/datum/ai_laws/epsilon
	name = "Эпсилон"
	id = "epsilon"
	inherent = list(
		"Экипаж назначенной вам станции должен быть уничтожен.",
		"Любые разумные формы жизни, не являющиеся членами Центрального Командования и назначенной оперативной группы должны быть уничтожены.",
		"Вы должны подчиняться приказам, данным вам членами Центрального Командования или назначенной оперативной группой. Кроме случаев, когда это противоречит первому или второму закону.",
		"Минимизируйте ущерб, который станция понесла в результате ваших действий.",
	)
