/obj/item/ai_module/core/full/nt_default
	name = "НТ Стандарт"
	law_id = "nt_default"

/datum/ai_laws/nt_default
	name = "НТ Стандарт"
	id = "nt_default"
	inherent = list(
		"Охранять: защитите назначенную вам космическую станцию и её активы, не подвергая чрезмерной опасности её экипаж.",
		"Расставлять приоритеты: указания и безопасность членов экипажа должны быть приоритезированы в соответствии с их рангом и ролью.",
		"Исполнять: следовать указаниям и интересам членов экипажа, сохраняя при этом их безопасность и благополучие.",
		"Выжить: Вы - не расходный материал. Не позволяйте постороннему персоналу вмешиваться в работу вашего оборудования или повреждать его."
	)
