export const PHYSICALSTATUS2ICON = {
  Активен: 'person-running',
  Болезнь: 'crutch',
  Бессознательность: 'moon-o',
  Мертв: 'skull',
};

export const PHYSICALSTATUS2COLOR = {
  Активен: 'green',
  Болезнь: 'purple',
  Бессознательность: 'orange',
  Мертв: 'red',
} as const;

export const PHYSICALSTATUS2DESC = {
  Активен: 'Активен. Личность в сознании и здорова.',
  Болезнь: 'Болезнь. Личность в сознании, но не здорова.',
  Бессознательность:
    'Бессознательность. Личности может потребоваться медицинская помощь.',
  Мертв: 'Мертв. Личность мертва и начала разложение.',
} as const;

export const MENTALSTATUS2ICON = {
  Стабильно: 'face-smile-o',
  Наблюдение: 'eye-o',
  Нестабильно: 'scale-unbalanced-flip',
  Безумство: 'head-side-virus',
};

export const MENTALSTATUS2COLOR = {
  Стабильно: 'green',
  Наблюдение: 'purple',
  Нестабильно: 'orange',
  Безумство: 'red',
} as const;

export const MENTALSTATUS2DESC = {
  Стабильно:
    'Стабильно. Личность вменяема и не страдает от психических заболеваний.',
  Наблюдение:
    'Наблюдение. Личность имеет симптомы психического заболевания. Требуется наблюдение.',
  Нестабильно:
    'Нестабильно. Личность страдает от одного или более психических заболеваний.',
  Безумство:
    'Безумство. Личность демонстрирует тяжелое и ненормальное психическое поведение.',
} as const;
