{
    "revelations": [
        "#There could have an entirely separate dimension only visible through pools of Blood, and we will never see it.",
        "#Explosions happen often, I wonder if one will strike me one day. I wonder if I'll survive.",
        "#The Captain will fall eventually, everything is only a matter of time.",
        "#There's always something there to be enlightened from. Something to learn. Something to teach.",
        "#Why have we been abandoned in this universe... When will we be taken away to the rest of the living?",
		"#When will the dreams stop following me? Why have they picked me, of all people?",
		"#The one listening to the voices in his head is called foolish from those unaware, but does that make him insane?",
		"#Oh dear... perhaps I've taken my life a little too far today. I wonder what's next.",
		"#Sometimes I feel like I am the last prophet to ever exist... Maybe I am.",
		"#I wonder what made me this way. Is it my Malkavian blood? My hatred for those around me?",
		"#Maybe I should start to think about what consequences my actions lead me to. Or maybe it's best not to think about it.",
		"#If I focus on my goals, rather than what I want to do, am I truly happy?",
		"#Maybe... in an alternate universe... I could be part of another family. One that cares more about me...",
		",lI wonder what other people think of me... Possibly terribly.",
		"#...What would happen if I Vassalized a Clown?",
		"#Why can't we just walk? Does anyone walk anymore? Why do we run? What rush are we in?",
		"#Medbay is overworking, I wonder why they are always so shortstaffed.",
		"#Why do we take a pod instead of the shuttle? Where's the fun in that?",
		",lHuh...",
		"#I was so close to a new revelation, but I lost my train of thought for a moment there.",
		"#What happens once all the organics die? Would just the unorganics remain?",
		"#Hmmm... What would happen if I killed a Command member...",
		"#Supermatters unnaturally look like candy... I wonder what would happen if I licked it...",
		"#Everyone thinks of me as a freak, at least I'm not a creep, then they'd be sorry.",
		",lDon't forget to use the Mentor tab to ask for help!",
		"#I wonder what they put on the bikes to cost a million credits...",
		"#I wonder if my upstream would accept me for who I am.",
		"#Is it possible... for the undead to get a heart attack? Nevermind, strange question.",
		",lWhat would happen if a Bloodsucker got their hands on a Power Miner?",
		"#There are Aliens, they exist. It isn't a conspiracy. The real question is when they will attack us.",
		"#Is Brain damage real, or is it just our brains adapting to reality?",
		"#How do we all understand eachother when we speak over eachother on the radio?",
		"#Huds are broken again, it seems...",
		"#Never make a deal with the devil... worst mistake of my life.",
		"#Does plasma still affect the minds of people who can't get poisoned?",
		"#Who thought sending a research station into a contested area was a good idea? Unless it's just sick and twisted humor... like a game!",
		"#How well would a Cryogenic Blob deal against my power?",
		"#It's possible to learn how to bloodcrawl...",
		"#Changelings are the purest form of a Human... if Humans were the most unpure thing.",
		"#I would like to take a stroll around the station, floating through the space around us... must feel nice.",
		"#Who thought of the idea of Health Analyzers? Like, something that instantly knows everything wrong with you?",
		"#How much of our soul does Nanotrasen REALLY own... they certainly don't own enough if they always have traitors among their crew...",
		"#I wonder how the Devil is doing today... haven't seen them in a long time.",
		"#We straight gassing cutting straight to the bricks ha ha.",
		"#This shit ain't nothing to me man.",
		"#I had to do it to them snipe.",
		"#I'm not loyal to anybody I'm a demon.",
		"#I have no loyalty for anyone never did never will.",
		"#Shorty chose to be with a demon sounds like her problem to, me ha ha!",
		"#Moving like Dracula we get it back in blood.",
		"#You see it I really did this I'm really him.",
		"#Flipped a whole brick into an empire stop playing with me.",
		"#Smoking fentanyl-laced blood; I see God.",
		"#Yeah we getting that Pirate Bay alien shish kabab cordycep money.",
		"#I just popped a whole garbanzo bean, fuck you mean?",
		"#I smoke real Emrānī rapscallion ghost nuggets.",
		"I'm him! I been him!! I will continue to be him!!!",
		"#They thought they could stop the demon, I'm back!",
		"#The zaza got me speaking Esperanto.",
		"#You can't trust me, I don't even trust myself. I don't even know who I am anymore, I'm getting too much money.",
		"#Get the Captain on the holocall now! I fronted him a brick, I need my money!",
		"#We smokin' Symbiotes.",
		"#Smokin' that Whoopi Goldberg south Egyptian kindred deluxe Mega Millions scratcher skunk bubba kush.",
		"#We smokin' Sequoia banshee boogers.",
		"#They must have amnesia, they forgot that I'm him.",
		"#Motherfucker look like a Resident Evil 5 campaign extra after we was done with him.",
		"#Ops wanted some initiative, blew up their entire quadrant, I'm moving like Cuban Pete.",
		"#I was flipping bricks for Mansa Musa before y'all even became a type 1 civilization.",
		"#I have seen the Magna Carta. I've seen the Eye of Hora.",
		"#You think I care about this shit? Ask me if I care about this shit, 'cause I don't give a shit! If I had a credit for every time they said I gave a shit, I'd be broke 'Cause I don't give a shit!",
		"#This .357 got me moving like an invasive species.",
		"#I got Midas touch shitter.",
		"#I'm at the vault boutta withdraw all of it.",
		"#That Fentanyl gave me Vitruvian Man flexibility. Got me in a state of rigor mortis.",
		"#Caught a broke boy trying to come up on my Amazon package, so I skinned his ass alive.",
		"#We smokin' Serge Ibaka spinal fluid infused quick-release percs.",
		"#They needеd a stealth soldier, so I put my hands on the hibachi hot plate at Benihana, and burned my fucking finger prints off. They will not find me...",
		"#Konichiwa you little jit.",
		"#Snortin' some premium Matisyahu got me fightin' for my life.",
		"#The Cuban link will turn the diamond tester into a pipe bomb.",
		"#Stechkin shivered his timbers.",
		"#I'm smoking Mesopotamian, Stanley Cup triple-award-winning, soul-bleeder, J.D. Power Associates, dingleberry zaza.",
		"#We smoking that IBM Quantum Computer.",
		"#My diamonds come from the most horrific situations possible.",
		"#Fuck it, I ate the opp.",
		"#Fuck it, I'm coming for every enzyme.",
		"#I'll fucking kill you!.",
		"#The first time I smoked runts, I coughed so fucking hard, I started passing kidney stones, then toolboxed myself in front of the gang!",
		"#Hold on, lemme get some sip.",
		"#The Codex should be treated like a Nuclear Authentication Disk, it is what guards this realm from the one below, afterall...",
		"#No one knows how to read anymore, no matter how 'in your face' you put things, they'll never get it.",
		"#150, 149, 148... 147, 146, 145, 144... What number was I at, again?",
		"#No matter what we do, the feeling of pain will be inevitable.",
		"#It seems Revolutionaries might take over the station today",
		"#Huh, Nuclear Operatives lost in space. That's new.",
		",lWhere did I go wrong in my mortal life to end up here...",
		"#The one that knows the Monster's tricks is sure to arrive. Only time will tell when.",
		"#What are we even doing on such a Station? Don't we all know this will end in disaster?",
		"#I can't think properly...",
		"#I wonder what the Ancient Greek philosophers would say if they were alive today.",
		"#I could go for some food just about now...",
		"#Some coffee would be life-changing right about now...",
		"#If only everyone saw the world in the same way I have",
		"#What did Humanity do to deserve my creation?",
		"#If we were all born for a reason, mine is completely idiotic.",
		"#If there really is a God, why would they allow me to exist?",
		"#...I think I lost track of something... I can't remember what...",
		"#Who is humanity to decide who someone is? Why should they meddle in my affairs?",
		"#The person everyone tries to silence, is the one people will miss the most",
		"#It's hard to tell if people just don't understand my level of philosophy, or if they just play dumb to get reactions out of me.",
		";This is your fault.",
		",lWhy do we always infight, what's wrong with a little teamwork, it gets us further.",
		"#What's a hacked autodrobe but a machine forced to show itself to you. Is it moral?"
    ]
}
