{
	"Acid Blood": "While defending, if a creature with Acid Blood is destroyed, the creature that destroys it is also destroyed.",
	"Art of the Deal": "You may reduce this card's power by the specified amount until the end of the turn to gain an equivalent amount of mana until the end of the turn.",
	"Asimov": "Creatures possessing this trait cannot attack or defend against creatures with the Human subtype. In cases where it has been forced to attack or defend against a Human, it is destroyed rather than attacking or defending.",
	"Bleed": "You can pay the specified cost in lifeshards to activate the listed effect.",
	"Blocker": "The creature cannot declare attacks, but can defend.",
	"Blood Pawn": "A creature with Blood Pawn may be sacrificed to gain mana equal to half of its base resolve, rounded up. This effect can only apply to a player once per turn.",
	"Carapace": "This creature negates 2 resolve damage that would be dealt to it during combat (i.e. when in combat with a creature with 3 attack, the creature with Carapace takes only 1 damage, having negated 2 points).",
	"Changeling": "This creature possesses all creature subtypes simultaneously. Any effects which affect a specific subtype apply to Changelings (i.e. a card that \"Deals 2 damage to Humans\" would also affect a Changeling).",
	"Clockwork": "The creature can copy a single keyword on another creature on the field, until they lose the Clockwork keyword or leave the field.",
	"Deadeye": "This creature can always hit opponents, regardless of effects or immunities.",
	"Death-Defying": "Any time the creature would be destroyed in combat, flip a coin. If heads, the creature is not destroyed.",
	"Double Strike": "This creature deals its damage twice: first as First Strike damage, and then a second time as Regular damage.",
	"Exterminate": "This creature gains +2/+1 when in combat against a Creature with the Human subtype."
	"Faction": "Groupings of cards that can often share effects and traits together.",
	"First Strike": "This creature has attack priority in combat (i.e. it deals its damage to the opponent before taking any damage in return).",
	"Flying": "This creature can't be blocked, except by other creatures with Flying or Long-Ranged.",
	"Focused": "The creature ignores creatures with the Blocker keyword.",
	"Fury": "The creature must attack at every possibile opportunity. If it is unable to attack for any reason (for example, it has been given the Stasis keyword, preventing it from attacking) it is destroyed.",
	"Graytide": "When this creature enters the battlefield, it gains +1/+1 for the number of creatures already on your side of the field with Graytide until the end of the turn. Creatures with this effect do not affect themselves.",
	"Hatred": "This creature cannot exist on the same side of the battlefield as creature of the type it has a Hatred of. If it is played as such, the creature(s) it has a Hatred of are destroyed.",
	"Hex": "This cardtype is played onto an enemy creature, applying its effect to that creature. If the Hex is destroyed, the effect ends.",
	"Hivemind": "The creature enters combat with a hivemind token on it. The first time this card would take damage, negate the damage and remove the token instead. This does not apply to immediate removal or destruction effects, only points of damage.",
	"Hulking": "Any power above a defending creature's resolve is dealt to the opposing player (i.e. if a creature with 3 attack and Hulking attacks a creature with 2 resolve, the opposing creature is destoyed and 1 damage carries over to the opposing player's lifeshards).",
	"Holy": "This creature has Immunity to all Event cards.",
	"Indestructible": "This creature cannot be destroyed by combat damage. Effects, keywords and events can still destroy it, however.",
	"Immunity": "The creature cannot be affected by card effects or combat against creatures of its Immunity type. This includes both friendly and opposing effects.",
	"Lifedrain": "Upon dealing lifeshard damage to an opposing player with a creature with Lifedrain, heal for one lifeshard.",
	"Long-Ranged": "This creature can block creatures with Flying.",
	"Modular": "When this equipment is attached to a creature, the creature gains +1/+1 in addition to the effects listed on the card.",
	"Oo Rah": "While attacking alongside 4 or more creatures with this effect, all currently attacking creatures with Oo Rah gain +1/+1.",
	"On Destruction": "When this card is destroyed, the listed effect occurs.",
	"On Equip": "When playing this card to the battlefield, select a creature on your side of the battlefield to equip it to. That creature gains the effects listed on the Equipment.",
	"On Summon": "When playing this card to the battlefield, the listed effect occurs.",
	"On Tap": "During your Play Phase, you may tap this card and pay the listed cost to activate its effect.",
	"Necrotaint": "Only one creature with Necrotaint may be on each player's battlefield at a time. In cases where a creature with Necrotaint is played when one is already on your battlefield, destroy the existing creature.",
	"Negate": "The card's effect is nullifed.",
	"Rapid Response": "This creature does not enter the battlefield tapped. This allows it to attack or use tap abilities on the same turn as it is summoned.",
	"Resistance": "Any damage from the listed source is reduced by the specified amount.",
	"Sacrifice": "You may destroy this creature, activating the listed effect.",
	"Squad Tactics": "When this creature attacks an opponent's creature and defeats it in combat, the owner of the defeated card takes 1 lifeshard of damage from combat.",
	"Stasis": "While in Stasis, the creature cannot attack, defend, or activate abilities. Any card effects or keywords they possess remain active, provided they do not cause the creature to attack, defend, or activate an ability.",
	"Systems Nominal": "The creature always fights as if at full strength.",
	"Taunt": "All opposing creature attacks must be directed towards the creature with Taunt.",
	"Toxic": "Any damage the creature deals to opposing creatures is fatal (i.e. even if a creature is left with remaining resolve after combat with this creature, it is destroyed). This does not apply to lifeshard damage.",
	"Tribute": "You can destroy cards fitting the required details from your battlefield to reduce the summoning cost of this card by the listed amount. You can use as many cards as desired, to a minimum cost of 1 mana.",
	"Triggered": "Play this Event card face down. When the specified trigger occurs, reveal the card to your opponent and activate the listed effects, then destroy the card.",
	"Under Pressure": "When this creature blocks, it gains the listed bonuses.",
	"Unstoppable": "The creature cannot be blocked.",
	"Vendetta": "When in combat with creatures of the specified Type, apply the listed bonuses and/or effect."
}
