// MARK: Papers
/obj/item/paper/fluff/centcom
	color = COLOR_BLUE_GRAY

/obj/item/paper/fluff/centcom/armory
	name = "Приказ департамента Специальных Операций"
	desc = "Обновленная методичка комплектации отрядов быстрого реагирования. Полезно для прочтения!"
	default_raw_text = {"<center><h3>Приказ департамента Специальных Операций </h3><br>
	<h5><i>"Обновленный порядок комплектации отрядов быстрого реагирования в кластере EE-223"<br>
	Регистрационный номер 442bb-22.1, Марс, главный координационный центр Специальных Операций Nanotrasen Inc., 2567 г.</i></h5></center>
	<hr>
	<h4><center>Настоящий приказ действителен и обязателен к исполнению во всем пространстве указанного кластера систем.</center></h4><br>
	За последние 3 года практика безконтрольного использования отрядов быстрого реагирования (далее - ОБР) активами компании достигла своего апогея.<br>
	Произведенный анализ расходов и эффективности подобной тактики привел к пересмотру предписанных действий командованию местных Центральных Командований во время ЧС на подконтрольных им объектах.<br><br>
	1. Каждый боец ОБР обязан иметь в быстрой доступности личный комплект боевого и/или специализированного снаряжения.<br>
	2. Текущий комплект личного боевого и/или специализированного снаряжения является <b>ДОСТАТОЧНЫМ</b> для разрешения 87% всевозможных ЧС.<br>
	3. Текущий комплект личного боевого и/или специализированного снаряжения может быть дополнен без доступа разряда "Офицерский" и выше по усмотрению бойца ОБР.<br>
	4. В зависимости от ситуации, <b> предоставленной в виде отчета с объекта </b>, офицер специальных операций (далее - ОСО) <b>и/или</b>, при его отсутствии, полевой офицер флота Нанотрейзен (далее - ПОЦК) имеют право предоставить следующее <u>дополнительное</u> снаряжение:<br><br>
	- <b>ШТУРМОВОЕ СНАРЯЖЕНИЕ</b> - комплекс туррелей, взрывчатки и барьеров. Использовать редко. <i><h5>(экономически затратно, "Страж Активов", выпуск 8843-2, стр.28)</h5></i><br>
	- <b>СРЕДСТВА ПРОТИВОЭНЕРГЕТИЧЕСКОЙ БОРЬБЫ</b> - самозарядные энергетические карабины, ЭМИ заряды. Использовать редко. <i><h5>(экономически затратно, "Страж Активов", выпуск 8843-2, стр.29)</h5></i><br>
	- <b>ЛЁГКОЕ ДОПОЛНИТЕЛЬНОЕ СНАРЯЖЕНИЕ</b> - наборы NT Ammunition типа "LG". Использовать на усмотрение ОСО <b>и/или</b> ПОЦК.<br><br>
	- <b>ТЯЖЕЛОЕ ДОПОЛНИТЕЛЬНОЕ СНАРЯЖЕНИЕ</b> - наборы NT Ammunition типа "HG". Использовать <b>только</b> на усмотрение ОСО. Использовать <b>крайне</b> редко. <i><h5>(экономически затратно, "Страж Активов", выпуск 8843-2, стр.29)</h5></i><br>
	- <b>БОЕВЫЕ КОРПОРАТИВНЫЕ ЭКЗОСКЕЛЕТЫ</b> - тяжелые боевые единицы армейского образца. Использовать <b>только</b> на усмотрение ОСО. Использовать <b>крайне</b> редко, рекомендуется код уровня █████. <i><h5>(экономически затратно, "Страж Активов", выпуск 8843-2, стр.33)</h5></i><br>
	- <b>ГРАЖДАНСКИЕ КОРПОРАТИВНЫЕ ЭКЗОСКЕЛЕТЫ</b> - стандартные механизированные вспомогательные единицы. Использовать на усмотрение ОСО <b>и/или</b> ПОЦК. <br><br>
	5. Каждый ОСО <b>и/или</b> ПОЦК обязан иметь на своем рабочем месте пульт дистанционного управления складами с <u>дополнительным</u> вооружением.<br>
	6. Весь офицерский состав местного Центрального Командования обязан помнить о крайне нежелательных экономических расходах при использовании <u>дополнительного</u> оборудования любого формата и обязан минимизировать материальные потери любой ценой.<hr>
	Глава департамента Специальных Операций Nanotrasen Inc.: <i><u>Дэвид Карлайл</u></i><br>
	Главный координатор Специальных Операций в кластере ЕЕ-223.: <i><u>Илай Ликсон</u></i><br><br>
	<i>Компания Nanotrasen,<u>28.12.2567</u></i><hr>
	<center><h5><i>КОНФИДЕНЦИАЛЬНАЯ ИНФОРМАЦИЯ. СОБСТВЕННИК NANOTRASEN INC. РАСПРОСТРАНЕНИЕ ТРЕТЬИМИ ЛИЦАМИ <b>ЗАПРЕЩЕНО</b>.</i></h5></center>
	"}
