/datum/uplink_item/stealthy_weapons/holster_uniform
	name = "Syndicate Holster (uniform)"
	desc = "Эта кобура была специально разработана лучшими технологами компании Cybersun Inc. На первый взгляд - это обычная коробочка для ручек, которая крепится к униформе. На деле же она способна вмещать нечто гораздо более крупное. Несмотря на единственный карман, кобура подходит почти для любого небольшого лазера или пистолета. Одурачь службу безопасности одним лишь её видом."
	item = /obj/item/clothing/accessory/holster/chameleon
	cost = 1
