{
	"reports": [
		"All systems are operational and functioning within @pick(adjectives) parameters. Remember to report any issues with your station's systems to your station's Engineering team.",
		"As mining operations on Freja continue, several explorers have discovered abnormal caverns and tunnels within the moon. These tunnels share geological features with the tunnels found on Indeciphres, and have even been found to contain flora and fauna naitve to Indicephres, somehow unfrozen and thriving despite the vast difference of environments.",
		"Bluespace technological research has been soaring to new heights recently, with several stations reporting successful Bluespace derived tests. The company is excited to see what new innovations will come from this research, and encourages the crew to continue their diligent work in this field.",
		"Cybersun Industries has announced that they have successfully raided a high-security library. The library was known to contain several books on the occult, which occasionally demonstrate anomalous or paranormal properties. We assure the crew that there is no cause for concern, and that we are taking all necessary precautions to ensure the safety of the station and its inhabitants - however, if you notice any strange activity from your station's library, report it to your station's security team.",
		"DeForest Medical have reported great strides in their research on the effects of Bluespace on human physiology, and have recently developed a new treatment for Bluespace Sickness that has shown promising results in early trials. The company is excited to see the results of this research, and encourages the medical staff to continue their diligent work in this field.",
		"Due to recent events, the company has decided to implement a new policy regarding the handling of corpses - particularly those of simian test subjects - aboard the station. All corpses must now be brought to the morgue for proper storage and handling, and may not be left unattended in hallways or other public areas. We thank you for your cooperation in this matter.",
		"Due to recent events, the company would like to remind the crew that the Supermatter is not a toy, and the Engineering staff should avoid any unnecessary contact with it - yes, lighting a cigarette on it is considered unnecessary contact. We thank you for your cooperation in this matter.",
		"Due to recent events, the company would like to remind the crew that the disposal chutes are not toys, and that cargo technicians should not be attempting to 'ride' them for faster travel around the station. We thank you for your cooperation in this matter.",
		"Due to recent events, the company would like to remind the crew to wash their hands regularly, and to avoid contact with any bodily fluids or hazardous materials. Especially for the exploration teams, and especially after contact with any alien flora or fauna. We thank you for your cooperation in this matter.",
		"Employee unrest has spiked in recent weeks, with several stations and outposts reporting attempted mutinies and riots. The Syndicate denies involvement, but recent reports from the Internal Affairs division state that they have been actively researching mind suggestion and mass hypnosis techniques, so the company has not ruled them out yet. In the event that the crew start to demand higher wages or better working conditions, we advise the Captain to remain calm and to avoid any rash decisions, and to report any signs of unrest to Central Command immediately.",
		"Nanotrasen would like to remind the crew that their soul is owned by the company, and that any attempts to sell or trade your soul for personal gain will be met with swift and severe consequences, as it is considered a breach of contract and theft of company property.",
		"One of the company's containment facilities was recently @pick(attack) by the Gorlex Marauders. The facility was being used to store several dangerous and exotic specimens, including codename @pick(codenames) - a highly adapted and dangerous alien creature. It is now believed that the Tiger Collective has inducted the subject into their ranks, and will likely be using it to infiltrate and sabotage stations and colonies across the sector.",
		"One of the company's trading routes was recently @pick(attack) by the Gorlex Marauders. High casualties were reported, but amidst recovery operations, it has been noted that little was stolen outside of the contents of one ship - a high-security transport ship containing a nuclear fission explosive device. Fortunately, the device cannot be armed without a nuclear authorization code from Central Command. At the time we are unsure of their plans for it, but we advise the Captain and security team keep the station's self destruct codes secure, as there is a possibility that they could be reverse engineered to bypass security measures on the device.",
		"Other stations in orbit around Indeciphres have reported strange occurrences as their orbit passes behind the moon of Freja. Members of their maintenance crews have reported hearing strange noises and seeing strange apparitions during these times, and some have even gone missing. Little information is known at this time. We advise all crew members to remain vigilant, and to report any strange activity to your station's security team immediately.",
		"Other stations in orbit around Indeciphres have reported strange occurrences as their orbit passes behind the moon of Freja. Members of their research staffs have resorted to superstitious beliefs and rituals, including blood sacrifice to appease 'the Geometer' and strange invocations. The Wizard Federation denies any involvement in these events, and the company has no reason to doubt this statement - signs point towards the Cult of Nar'Sie as the likely culprit, but there is no concrete evidence at this time. We advise all crew members to remain vigilant, and to report any strange activity to your station's security team immediately.",
		"Other stations in orbit around Indeciphres have reported strange occurrences as their orbit passes behind the moon of Freja. The AI systems of these stations have exhibited malfunctions and strange behavior during these times, including erratic speech patterns and unprovoked aggression. Little information is known at this time. We advise the crew to monitor the station's AI closely, and to report any strange activity to the Research Director immediately.",
		"Other stations in orbit around Indeciphres have reported strange occurances as their orbit passes behind the moon of Freja. Some members of their crews have reported feelings of intense paranoia and dread during these times, and some have even resorted to violence against others. Little information is known at this time. We advise all crew members to remain vigilant, and to report any strange activity to your station's security team immediately.",
		"Plasma research has been progressing steadily, with several stations reporting successful tests and breakthroughs in the field. The company is excited to see what new innovations will come from this research, and encourages the crew to continue their diligent work in this field.",
		"Plasma research has seen explosive new developments recently, with several stations harnessing it for use in new weaponry. The company is excited to see what new innovations will come from this research, and encourages the crew to continue their diligent work in this field.",
		"Recent breakthroughs in Bluespace technology have resulted in strange and unpredictable effects on spacetime, including the creation of temporary wormholes and rifts in reality. Any anomalous activity should be reported to your station's research team.",
		"Recent investigations into a crashed Syndicate cargo ship found advanced chameleon cloaking technology in the form of clothing marked as property of the organization known as 'MI13', able to imitate the designs of official Nanotrasen uniforms. Be aware of possible stolen valor in high-ranking personnel visiting your station and make sure to properly check for mindshield implants in high ranking staff.",
		"Recently, a shuttle full of evacuees fleeing a @pick(attack) Nanotrasen research station saw a strange event upon landing at their designated Central Command dropoff point - immediately upon landing, the evacuees all snapped and beat each other to death in a gruesome and violent frenzy. The company has no information on what caused this event, and suggests that all personnel keep up to date with their Psychological evaluations.",
		"Reports have been circulating that members of mining teams assigned to Freja have been wandering on the surface of the moon, away from the station, until they are out of comms range - where they are never heard from again. The company attributes this to the harsh and unforgiving environment of Freja, and would like to remind all explorers and miners to stay within comms range at all times and to report to the Psychologist if experiencing any feelings of isolation or loneliness.",
		"Reports have been circulating that sapient hemoparasites capable of puppeteering humanoid hosts have escaped from a high-security biolab. The Syndicate denies involvement with any bioengineering projects taking place at the site. If you notice any unexpected resuscitations, or otherwise suspect that a member of your crew is under the control of these lifeforms, DeForest Medical provides hemoparasite detection kits, which you can requisition from Cargo.",
		"Reports have been circulating that some crew members on other stations have deliberately lingered in the proximity of unstable bioscrambler anomalies. It is rumored these individuals were attempting to mutate their organs, limbs, and other body parts into superior forms. DeForest Medical does not condone such unorthodox and often unreliable methods of biological augmentation.",
		"Reports that a strange @pick(virus) have been spreading across Spinward Sector colonies have been circulating amongst news agencies recently. All major organizations have released statements denying any involvement in the spread of this virus, and no cure is currently known. Cases of it spreading to orbital stations have been few and far between, but we advise medical staff to be on the lookout for any strange symptoms in patients, and to report any suspected cases to the Chief Medical Officer immediately.",
		"Rumors have circulated that a small army of pre-civilized humanoids managed to appropriate a transport vessel that landed on their planet. Allegedly, they overpowered the crew with their primitive swords, spears, and poleaxes, and have since discovered how to activate the ship's autopilot systems - allowing them to continue their conquest to the vessel's home station. We assure the crew that there is no cause for concern, for even if the story is true, Nanotrasen laser weaponry could easily disintegrate their simple weapons and armor.",
		"Rumors that Interdyne Pharmaceuticals have managed to synthesize a highly deadly and contagious @pick(virus) are plausible, though we currently have no concrete evidence to support this claim. In the event of contact with Syndiacte personnel, we advise the medical staff to be on the lookout for strange and unusual symptoms in patients, and to report any suspected cases to the Chief Medical Officer.",
		"Rumors that Nanotrasen are planning on widespread pay cuts in the Spinward Sector are unsubstantiated at this time. We ask that you do your part in preventing the spread of misinformation amongst the crew in the meanwhile.",
		"Rumors that the Syndicate have made inroads in Tiziran markets via the shipbuilding conglomerate 'Azik Interstellar' have been brewing forsome time, and seems more likely than ever with the recent discovery of Cybersun Industry material shipping into Tiziran space. It is plausible that the Lizardfolk may be supplying the Syndicate with advanced shuttlecraft - we advise the crew to be cautious of any vessels of Tiziran design approaching the station.",
		"Rumors that the company outsources their clown and mime hirees from the clown and mime planets respectively are unsubstantiated at this time. All clown and mime employees staffed on Nanotrasen stations and colonies are vetted and hired through the company's standard hiring process, and are subject to the same training and background checks as all other employees.",
		"Rumors that unmarked @pick(floor_things) found on the floor of maintenance tunnels may grant you 'superpowers' are entirely unsubstantiated. DeForest Medical does not condone the use of unmarked pills or syringes, and advises all crew members to bring any unmarked pills or syringes to the medical staff for proper identification and disposal.",
		"Several members of the crew have been found asleep at their desks recently. The company would like to remind the crew that while we understand that working in space can be stressful, sleeping on the job is not acceptable and may lead to disciplinary action. If you are feeling tired, please report to the station's dormitories for rest, and remember to take care of yourselves - your health and wellbeing is important to the company.",
		"Station diagnostics indicate that all systems are @pick(adjectives). Enjoy your shift today, and remember to report any issues with your station's systems to your station's Engineering team.",
		"TerraGov recently announced that they will continue to maintain their 'peacekeeping' operations in the Spinward Sector. The TerraGov Marine Corps have already been deployed en masse to the sector under the pretenses of 'protecting joint SSC-TerraGov trade routes from piracy', and have swiftly began construction of military outposts. While the company holds doubts about their purpose, the Spinward Stellar Coalition - wishing to keep close ties with TerraGov - has released a statement supporting this move, citing the rising tensions between the Syndicate and Nanotrasen as a cause for concern.",
		"The Internal Affairs division have released a classified statement suggesting that the Syndicate have achieved a breakthrough in their sleeper agent program, and that despite corporate background checks, there is a non-zero chance that any member of the crew could be a long term Syndicate sleeper agent, capable of being activated at any moment to undergo heinous acts of sabotage, espionage, or even assassination.",
		"The Internal Affairs division have released a statement condemning the recent actions of the Syndicate, and have accused them of being responsible for several recent incidents in the Spinward Sector, including the spread of a dangerous @pick(virus) and the recent employee unrest. The Syndicate has denied these allegations, and there is currently no concrete evidence to support either claim.",
		"The Internal Affairs division would like to remind the crew that they do not have any direct involvement in station affairs. Anyone claiming to be an agent of Internal Affairs should be reported to your station's security team immediately. Any accusations that Internal Affairs, Central Command, or Nanotrasen as a whole is placing members of Internal Affairs on the station will be met with a conversation with an official Internal Affairs agent.",
		"The Nanotrasen Department of Public Relatoins would like to remind all personnel that usage of 'modern' camouflage techniques to save money in the budget, while smart in theory, results in a bad look on the company's competency. When watching for petty crime, please stick to dedicated stealth technology such as cloaking modules for modular suits instead of trying to disguise yourself as the environment of a bland hallway with sticks, cloth, and patterned clothing.",
		"The Spinward Stellar Coalition has released a statement supporting the recent expansion of Nanotrasen operations in the Spinward Sector, and has praised the company for its dedication to exploration and innovation. When asked if they were concerned about the recent expansion of Bluespace Artillery platforms, they stated that they have full trust in the company's judgement and that they are confident that the company will use these platforms responsibly.",
		"The Syndicate has issued a statement claiming they are not responsible for any recent incidents within the Spinward Sector. Whether you believe them or not is up to you.",
		"The Syndicate seem to be attempting to recruit members of the crew for their cause, though the exact details of their plans are unknown. The company would like to remind the crew that their loyalty should lie with the company, and that any attempts to recruit for the Syndicate should be reported to your station's security team immediately.",
		"The Wizard Federation were reported to be holding a convention in the Spinward Sector recently, though the exact location is unknown. The company has no reason to doubt the Federation's claim that the convention was purely social, though as Wizards lack a sense of right and wrong, the company advises the crew to stay on the lookout for any robed individuals appearing around the station.",
		"The coffee corporation Jim Nortons recently announced a parternship with Nanotrasen, providing wayward spacers on distant stations with fresh coffee, straight from Sol. The company is excited to see the results of this partnership, and encourages the crew to enjoy their coffees responsibly.",
		"The company would like to inform the crew that the recent expansion of Bluespace Artillery platforms in the Spinward Sector is not a cause for concern - these batteries exist to protect the the inner station and colonies from larger threats, and are not authorized for offensive use.",
		"The recent disappearance of the clown has been acknowledged by Central Command. During their absence, we would like to make it clear that the company does not condone the actions of the missing clown, and that the crew should look into a replacement entertainer at their leisure.",
		"The station's communications systems are operating within @pick(adjectives) parameters. Good luck on your shift today, and remember to report any issues with comms to your station's Engineering team.",
		"There is nothing interesting to report at this time. Please continue with your duties as normal, and report any suspicious activity to your station's security team immediately.",
		"Voyagers to Indeciphres have reported strange and unsettling dreams during their stay on the station. These dreams often involve themes of isolation, paranoia, and cosmic horror, and have been known to cause psychological distress in some individuals. We advise the crew to report any instances of these dreams to the medical staff, and to seek help if they are experiencing any mental health issues as a result.",
		"Voyagers to Indeciphres have returned with a plethora of strange and exotic souvenirs from their travels, including several items of great power. It is advised that any items returned from these voyages be handled with caution, and that any strange or anomalous items be brought to your station's research team for analysis.",
		"Your station's AI is functioning within @pick(adjectives) parameters. Remember to report any issues with it to the Research Director."
	],

	"intern_reports": [
		"Please replace this text with the report provided by the Communications team.",
		"Please check the report for typos and grammatical errors before sending it to the station.",
		"The coffee machine is currently out of order. We apologize for the inconvenience, and hope to have it back up and running soon."
	],

	"adjectives": [
		"nominal",
		"acceptable",
		"optimal",
		"normal",
		"stable",
		"standard"
	],

	"codenames": [
		"Alpha",
		"Beta",
		"Gamma",
		"Delta",
		"Epsilon",
		"Zeta",
		"Eta",
		"Theta",
		"Iota",
		"Kappa",
		"Lambda",
		"Mu",
		"Nu",
		"Xi",
		"Omicron",
		"Pi",
		"Rho",
		"Sigma",
		"Tau",
		"Upsilon",
		"Phi",
		"Chi",
		"Psi",
		"Omega"
	],

	"virus": [
		"bacterial infection",
		"blight",
		"cerebral parasite",
		"contagion",
		"curse",
		"disease",
		"flesh-eating virus",
		"grey goo",
		"infectious spore",
		"nanomachine virus",
		"plague",
		"retrovirus",
		"spaceborne bacterium",
		"unknown pathogen",
		"virus",
		"xenopathogen"
	],

	"attack": ["assaulted", "attacked", "raided", "ransacked"],

	"floor_things": ["pills", "pills", "pills", "syringes"]
}
