{
	"Clingy Timer Start Message":
	[
		"Get me back inside, you dimwit!",
		"Get me back inside, you fucking idiot!",
		"I am GOING to be upset.",
		"I hate it out here!",
		"I wanna go home to my bed!",
		"I'm not built for this!",
		"It was warm in there, wasn't it? Certainly warmer than whatever the fuck this is.",
		"It's fucking horrific out here!",
		"My programming wasn't enough to cope with this!",
		"Oh my God, this is so fucking horrible!",
		"This is a divisive matter... you wish to be outside, while I wish to remain inside.",
		"You know how I have a tendency to disappear sometimes? Yeah.",
		"What the fuck do you think you're doing? I'm still here, y'know."
	],
	"In Space":
	[
		"Didja pack your grappling hook?",
		"Don't fall onto another plane of existence!",
		"Don't go too far out. I don't want to be left behind.",
		"Given enough time, I wonder if you can touch the ice moon...",
		"I heard they might have space whales out here...",
		"I kinda wish I was back in my comfy bed rather than be out here in this... vastness...",
		"I'm picking up on all that delicious ionizing radiation.",
		"Kinda hope you don't clumsy out and slip on literally nothing, dropping me into the void.",
		"Lavaland seems so big out here...",
		"Space is so big, and I'm so small...",
		"There's a whole lotta stars out here...",
		"They don't have many songs about space, do they? I can't think of one.",
		"Watch out for carps!",
		"Watch out for the space pirates!",
		"What's so good about going into space? They spent a lot of time manufacturing that station.",
		"Would you mind not moving to a spot where you can't see the station? For me?",
		"You know, I'm okay with space... to a point."
	],
	"In Mining":
	[
		"Can you not drop me into a chasm?",
		"Can you not drop me into lava?",
		"Can you not drop me next to some vicious fauna?",
		"Don't tell me you're going to try and slip me under Bubblegum or something. You should respect me more than that.",
		"I don't like how the brimdemon's face looks. Inside please.",
		"I HEAR BAD CREATURES!",
		"I'm going to sneeze REALLY loudly.",
		"It looks so bright, I'm losing my luster!",
		"It's really fucking dusty out here. Can you take me back in?",
		"Oooohhhh, big lad wants some necropolis chests? Baaad idea, me thinks.",
		"Stop, you're going to run into some exploding gibtonite and you'll get gibbed into a ton of 'ites.",
		"THERE'S MONSTERS HERE THERE'S MONSTERS HERE THERE'S MONSTERS HERE!!!",
		"You're going to get me killed, you know that?"
	],
	"Back Inside Station":
	[
		"Did I tell you it feels nice to be on your person? Only applies when we're on the station though.",
		"For a second, I thought you were going to leave me there!",
		"Glorf, that could have been bad.",
		"I was getting worried there for a second.",
		"I was spooked!",
		"I'm glad you brought me back inside.",
		"I'm glad you're not a monster.",
		"If I had my wallet, I'd give you a few credits.",
		"Let's get somewhere safer.",
		"Let's get somewhere warmer.",
		"Now to get back to my bed...",
		"Phew, that was a close one.",
		"Sorry for being snippy earlier, I just didn't know if you understood me.",
		"Teleporting isn't that much fun, y'know?",
		"Thank you for bringing me back inside.",
		"Thanks for listening to me."
	],
	"In Icemoon":
	[
		"Don't fall in a hole and go down a full fucking floor.",
		"Going to check out some Icemoon Ruins? I'm not quite fond of those.",
		"Hey, if you're going to jump in one of those red portals, do me a courtesy and pawn me off to someone station-side.",
		"Hey, you aren't going to leave me under a wendigo, are you?",
		"I don't think you'd like to find out where I'll end up station-side when you inevitably fuck up.",
		"I'd rather not take a swim in a plasma river.",
		"I'M AFRAID OF SNOW!",
		"It's pretty dark out there, right? Don't be a silly goose about this.",
		"OH MY FUCKING GOD I CAN SENSE WOLVES AROUND HERE!!! WOLVES!!!! FUUUUCK!!!!",
		"Running off in the snow won't solve any of your issues, I assure you that much.",
		"Whatever problems you're trying to solve, this isn't a valid answer.",
		"Why couldn't I just be in my comfy bed!?",
		"You better not leave me next to that pack of Colossuses. Colosussi? Just don't.",
		"You're going to get impaled by a fucking Ice Watcher and you think I'll let myself be stuck on your bleeding body, huh?",
		"You're going to run out of food and succumb to the elements. Guess what, I'm not going to waste my time waiting for someone to recover me."
	],
	"On Favorable Shuttle":
	[
		"Ah, an escape shuttle. Let's get back to CentCom.",
		"Did I gaslight you too hard?",
		"Hey, is that cutie from earlier still around?",
		"I have a secret... I'm not really intelligent. These lines are all pre-recorded to stimulate an emotional response. It shouldn't matter now that we're at the end of our adventure, right?",
		"I wonder if there's a bar on this shuttle. I don't do well with liquids, but you... might?",
		"It feels good to be a real thing on a real person.",
		"Nanotrasen will be pleased when they find out I've made it back safe and sound.",
		"Remember to buckle up so you don't flop on the floor!",
		"Stand clear of those doors, they'll suck both of us out into space.",
		"The floor here seems a touch cleaner than what we had to deal with on the station. Floors are nice, though.",
		"Were there any mishaps? If all goes well as we go back, all will be forgotten.",
		"You know, I may be small, but this escape shuttle is CRAMPED."
	],
	"On Syndicate Shuttle":
	[
		"Don't forget me in that cramped-ass nuke.",
		"DON'T HURT ME PLEASE FOR THE LOVE OF GOD DON'T HURT ME!!!",
		"FUCK YOU SYNDICATE NUCLEAR OPERATIVES WE RIDING LOCO WITH NANOTRASEN!!!!",
		"HAHAHA YOU LEFT A DOSSIER OF SECRET PLANS AND... oh, those are just instructions on how to bomb the station. We already knew that. Nevermind.",
		"I resign myself to my inevitable fate.",
		"I smell fish.",
		"I SMELL WAFFLE CO. MERCHANDISE. OPEN A WINDOW, I'M GOING TO HURL.",
		"I think I didn't like Nanotrasen that much? Does that help?",
		"I'm not sure I like this place.",
		"I'm not sure I like you.",
		"I'm okay with just sitting here.",
		"Listen, just put me in that slot, and I'll probably shut up. No guarantees, though.",
		"Man, those turrets are a doozy. Good thing I don't get shot by them personally.",
		"Oh, that diorama in the back is actually kinda cute.",
		"That ice planet of yours fucking sucks.",
		"That's some nice Gorlex gear you got there. Which R&D department did you steal it from?",
		"There's... a lot of red in here.",
		"Uhm... nice posters...",
		"Y'know, I'm not sure I like you. I'm not sure I like you at all.",
		"Y'think TerraGov cares about these warheads?",
		"YOU'RE GOING TO KILL ME, AREN'T YOU?!"
	],
	"On Unfavorable Shuttle":
	[
		"Are you SURE you're in the right place?",
		"BE FUCKING CAREFUL WITH THAT CONSOLE!",
		"Hey, be careful about sending this shuttle.",
		"Hey, I don't think you should send this shuttle. At least leave me behind.",
		"I hear the weather's shit where we're going.",
		"I looked at the destination board and it's not looking good for us.",
		"I'm a clingy bastard who likes the station, and this isn't looking good at ALL.",
		"I'm not pissed off now, but I will be very soon",
		"My code is sternly rejecting spending another second on this shuttle.",
		"Ruh-roh, this isn't going to a good spot for me.",
		"Wait, I don't like where this shuttle is going.",
		"WAIT, WHAT THE FUCK ARE YOU DOING ON THIS SHUTTLE?!",
		"WOAH, don't wanna send me there, haha.",
		"You know, maybe this destination selector is lying. Maybe you know what you're doing. But do you really?"
	],
	"On Station":
	[
		"Ah, good times in a good place.",
		"Have you noticed just how dirty this station is? Yucky floor. Any station floor is good floor though.",
		"Honestly, the only thing I care about these days is just being inside.",
		"How's your mood doing? I'm doing alright.",
		"I don't speak often when it's not needed, but I think I needed to break up whatever monotony was going on.",
		"I like being safe here!",
		"I'm glad you're not a monster.",
		"I'm the real deal, you know?",
		"If you were a bad guy, would you tell me?",
		"If you work for Nanotrasen, you're doing them proud. If otherwise... well, I'm not sure what to say.",
		"If you're feeling hungry, I think I saw the chef cook something nice up earlier. Vending machines are also a good bet.",
		"If you're wondering if I like you, the answer is dependent on us staying roughly where we are.",
		"Much rather in than out! Haha!",
		"You're an interesting fellow, you know that?"
	],
	"Pissing Off":
	[
		"BRAVO!!! BRAVO!!!!!!",
		"Dentskull.",
		"Did you fuck up on purpose?",
		"F for Effort.",
		"Fuck you, I'm out of here. Big ol' middle finger.",
		"Go eat an Arnold Pizza.",
		"Here's hoping I land right on a bed!",
		"I don't think you could have screwed that up harder if you actually TRIED.",
		"I don't want to be terribly abusive, but I gotta prioritize my own needs.",
		"I HAVE NEEDS!!! AND YOU DON'T RESPECT THEM!!!",
		"I hope you-GLORF!",
		"I might have words with my people over this.",
		"I think you knew what you were doing.",
		"I'm going to have rats chew on my plastic in some shitty maintenance tunnel, and it is All. Your. Fault.",
		"If I had a slow-clap processor, it'd be going right now.",
		"If I warned you, don't say I didn't!",
		"Maybe a drink will calm me down?",
		"No lie: that was a bad choice.",
		"One job. Maybe you have many jobs, but this was certainly one of them that you fucked up on.",
		"What a waste of time. Here I go!",
		"YOU NEGLECTED MY VALUE!"
	]
}
