{"21 April 2021":{"Ghilker":[{"2":"players can change the thermomachines pipe color with the multitool right click when it's unanchored."},{"0":"fixed hitting the machine with tools in some cases"}],"Greniza":[{"7":"added new icons for reverse bear trap: inhand, worn, and item icons."},{"7":"added minor animation to the reverse bear trap sprite"},{"7":"added update_overlays() function to /obj/item/reverse_bear_trap/"},{"8":"deleted old icons for reverse bear trap."}],"Mothblocks":[{"0":"Windoors will now properly block you after the underlying tile changes twice."}],"SuperNovaa41":[{"0":"The population locked traitor items now properly unlock in the uplink."},{"9":"Changed harm intent to combat mode in codex cicatrix"},{"9":"Extracting or inserting eyes gives a proper message."}]},"20 April 2021":{"jlsnow301":[{"5":"Players can now initiate votes using the new vote panel (assuming CentCom allows it)."},{"0":"Admins' voting list is now properly rendered"}],"maxymax13":[{"12":"completely cleaned up all traces of old unwearable caution signs"}]},"19 April 2021":{"Ghilker":[{"13":"better emitters and collectors code"}],"Kylerace":[{"11":"you can no longer destroy the tram control console. you cant grief as well as the tram can so stop breaking it out of jealousy"}],"Mothblocks":[{"0":"Fixed a lot of nonhuman species being unable to strip others."}],"Orchian":[{"5":"worn icon for geiger counters"}],"Ryll/Shaps":[{"0":"Admin logs showing someone being stripped of an item will now correctly show the perp's name/ckey"}],"SpookyTheFox":[{"0":"fixed the cyborg shaker"}],"stylemistake":[{"2":"Arrow keys are grabbed by TGUI for keyboard navigation, and won't be moving your character."}],"vincentiusvin":[{"0":"RPD's scroll mousewheel to change layer should now be snappier and more responsive. It is also no longer flipped."}]},"18 April 2021":{"ArcaneDefence":[{"9":"Ice cream vats don't needlessly say the an additional time when dispensing cones."},{"0":"Statues can be rotated by alt clicking on them now."}],"CeUvI":[{"7":"Resprited beakers and bottles."}],"Celotajs":[{"0":"Stopped obscenities from appearing on slot machines"}],"Foxtrot (Funce)":[{"0":"Bone Gel Recipe works again!"}],"Ghilker":[{"0":"bluespace vendor no longer get stuck when the gas you filling with finishes midway"}],"JosephJomama":[{"0":"Bounty cubes now pay out the correct speedy delivery bonus."}],"Y0SH1M4S73R":[{"2":"You can now remove people's wigs via the strip menu. As a consequence, doctors can now perform head surgeries on incapacitated wig wearers."}],"dragomagol":[{"2":"Kilostation medbay has been renovated! The security checkpoint has been moved to face the lobby, the old sec checkpoint has been made into an operating theatre, cryogenics and the exam room have traded places, and the delivery office is now a paramedic dispatch!"}],"necromanceranne":[{"11":"Armor now checks if an attack is weak against armor, and if so, multiplies any existing armor by two."},{"11":"Hollowpoint bullets and shrapnel now follow this logic, and no longer grant someone additional armor if they have any armor at all."}]},"17 April 2021":{"InsaneRed":[{"5":"Adds O2 to Pure pipeline on icebox atmos and fixes air mix pipeline to take up less space and work better with smartpipes."}],"Mothblocks":[{"0":"Fixed edge cases where some things that could strip should not have."}]},"16 April 2021":{"Anonymous":[{"0":"Mailman jumpsuit no longer exposes yours back when looking at left/west."}],"Arkatos":[{"12":"Wirecutters now use a new greyscaling method for their sprites."}],"FernandoJ8":[{"0":"Hangover trait applies rest rather than sleep so that the roundstart held items of MDs and plasmamen aren't lost."}],"Fikou, Jegub":[{"5":"Adds Trader NPCs, currently unused"}],"Ghilker":[{"11":"insuls will give you the trait TRAIT_CHUNKYFINGERS (you can't shoot gun with normal firing pins while wearing them)"},{"11":"you can't use modular computers with this trait now (you can open them before putting the gloves on)"},{"11":"CE now has advanced insuls that won't give the debuff traits (on the same idea of the advanced mag boots and the suit)"}],"Iamgoofball":[{"0":"You can now put food on the IV drip again."}],"JJRcop":[{"2":"Derelict drones have had their limits released"}],"John Willard":[{"0":"Flypeople can now use more than 1 S"},{"7":"Fly eyes are now its own eyes, rather than being attached to the head."},{"0":"Flypeople cultists' eyes now properly glow red (More then they already do)"}],"JohnFulpWillard":[{"9":"Slightly changed the smoke bomb description"}],"LemonInTheDark":[{"0":"The snow tiles spawned by the anomalus crystal will no longer infinitely produce cold air"},{"11":"Stormtrooper aim is now more consistently bad, the same can somewhat be said of anything that affects spread, but it's random already so who knows"}],"Seris02":[{"11":"adds a stun time modifier (reducing the stun) to climbing tables for the freerunning quirk, and reduces the knockdown penalty for the freerunning falling down z levels"}],"Thalpy":[{"0":"Fixes traumas caused by bone fractures not repairing after treatment"}],"Time-Green":[{"0":"Junkie pills quench addictions again"},{"11":"Now takes one minute to start withdrawal from addictions, down from 1 second (also made you withdraw while still using)"},{"11":"Quenching opiod addiction clears disgust, so you wont spent the next 20 minutes being vomitlocked"}],"Trigg":[{"0":"The Select Equipment menu now uses the UI owner's favorite outfits instead of the target mob's. Whoops."}],"norill":[{"5":"You can now close airlocks by gently punching floors (not in combat mode)"}],"tralezab":[{"11":"Changes the faster fireman carrying traits on skillchips into a nitrile glove trait."}]},"15 April 2021":{"Fikou":[{"7":"checker and cafeteria floors can now have dirs"}],"IndieanaJones":[{"3":"Reduced how loud Space Dragon's roar is"}],"Qustinnus":[{"11":"Ethereal blood no longer shocks."},{"11":"Liquid electricity found in food is now enriched, retaining the effect removed from the liquid electricity found in blood, which has less electrical properties. Enriched liquid electricity can also raise an ethereals blood levels"}],"Ryll/Shaps":[{"5":"Nanotrasen's Human Resources department would like to remind crewmembers that shattering mirrors, whether by striking them or shooting them, will bring you bad luck and probably also get you maimed. Don't do it!"}],"Sparkezel":[{"2":"Engineers and CE have NT CIMS installed on the tablets from the start"}],"SparkezelPL":[{"0":"You can no longer hit canisters with tanks"}],"carshalash":[{"0":"Gives white russians a proper ratio of creation."}]},"14 April 2021":{"ArcaneDefence":[{"0":"Clown outfits, grilling shorts, and russian officer's uniforms are no longer able to be adjusted into a purple and black trench coat."}],"Celotajs":[{"15":"Added a configuration option for splitting the admin tab into multiple tabs"},{"15":"Interviews have been moved to the Tickets tab"},{"2":"It is now possible for administrators to split the admin tab into multiple tabs"},{"0":"Fixed flashing for non admin users"}],"Cocacola4124":[{"0":"Fixes exploit in orion arcade machine that allowed players to steal, sell, and buy resources without being at a spaceport."}],"Fikou":[{"6":"icebox no longer has more prisoner slots"},{"0":"because of this, you can no longer latejoin as prisoner"}],"Ghilker":[{"2":"firelocks won't close if there is an atmos holofan on their turf."}],"Guillaume Prata":[{"0":"After many issues with plasmaman prisoners escaping perma and hiding in maint, NT will supply the station with up to date envirosuits with their suit sensors locked, just like other prisoner uniforms."}],"JJRcop":[{"5":"Maintenance Drones are once again constructable in Robotics."},{"6":"The Drone Dispenser has not made a return."},{"14":"New settings DRONE_REQUIRED_ROLE, and DRONE_ROLE_PLAYTIME, which determine the playtime exp required for playing drones."}],"JohnFulpWillard":[{"0":"Command personnel can now use the Science Hub tablet app they start with."}],"Ryll/Shaps":[{"2":"Examining an AI's camera eye as a ghost will now show you their laws, the same as if you examined their core"},{"2":"Added keybinds for moving up/down z-levels, useful as a ghost on multi-z maps! These default to the page up/page down buttons (previously used as the secondary binds for switching hands and activating items in hand)."}],"Thalpy":[{"0":"Fixes mannitol (and possibly neurine) from causing runtimes if no effects can be applied."}],"actioninja":[{"0":"radials layer correctly"}],"jlsnow301":[{"5":"The cryopod machine has been added, an IC way to reopen job slots for yourself and other players."},{"5":"AFK and SSD players can be placed into cryopods to reopen their job slot."},{"13":"Refactored cult sacrifice targeting to compensate for players logging out."}],"necromanceranne":[{"0":"Monkeys can no longer get into mechs."}],"norill":[{"0":"fixed infinite airlock electronics from deconstructing blast doors"}],"tralezab":[{"13":"added podspawning helper codewise, most code pod spawns use it"},{"2":"captains name their respective celestial bodies"},{"0":"honorbound god won't get mad anymore for JUSTICE."}]},"13 April 2021":{"ArcaneDefence":[{"5":"You can now choose to have a fear of guns if you take the phobia quirk."}],"BootlegBow":[{"9":"fixed grammar on computer hardware tech node"}],"FernandoJ8":[{"0":"Atmospherics Envirogloves are no longer insulated."}],"Ghilker":[{"0":"fix HFR corners disappearing on build"},{"0":"color adapters can connect again to all colors regardless"},{"0":"Allow the pneumatic cannon to be created with the smart pipes fitting"},{"0":"fix deltastation and icebox toxins from merging some pipes with distro/waste"}],"Greniza":[{"5":"added non-adjustable mask which allows internals, is sterile, and muzzles a patient or victim, complete with sprites"},{"7":"replaced standard sterile breathmask in anesthetic closet with above muzzle breathmask"},{"5":"adds BLOCKS_SPEECH clothing flag and reworked muzzle code and is_muzzled() function be based on flag"}],"IndieanaJones":[{"2":"Space Dragon's gust attack is now tied to right click instead of an ability button"},{"11":"Space Dragon has received numerous balance changes, most notably that Space Dragon will stall the shuttle until it loses or completes its objectives"},{"0":"Fixed numerous bugs with Space Dragon, most notably the rifts not vanishing after Space Dragon's death"},{"3":"Space Dragon now has a custom roar for dying and winning"},{"8":"Deleted now unused Space Dragon ability icon"},{"13":"Space Dragon's speed changes are now controlled using movespeed modifiers instead of direct speed adjustments"}],"JoshAdamPowell":[{"11":"skillchip implanters are now more efficient!"}],"Kangarad":[{"11":"Ashwalkers have been seen to not be affected by viruses anymore, likely due to evolution"}],"LemonInTheDark":[{"0":"Some stuff that applied blurred vision and roatated things on screen wasn't working, let's fix that up shall we?"},{"11":"Rotting things are less potent, and will ramp up their effectiveness over time, rather then being all or nothing"},{"11":"Radiation related pluoxium will now only generate in gasmixes under 200K, remember to keep that sm cold"}],"Melbert":[{"0":"Slippery things in your pocket no longer make you slippery. If you want to become slippery, you need to wear slippery things on your person actual."}],"Mothblocks":[{"0":"Fixed humans not having any eyes."}],"SgtHunk":[{"9":"Fixed a small typo that existed on the medical kiosk's radiation poisoning warning."}],"Timberpoes":[{"5":"Added a new config option that makes ID cards picked up by low living hour players automatically flagged with an intern-esque title."}],"nightred":[{"11":"Skeletons heal more when drinking milk"},{"0":"fixed reagents not metabolizing properly"}]},"12 April 2021":{"Celotajs":[{"0":"Prevented departments from having negative or undefined open positions in the crew manifest"}],"Melbert":[{"13":"TGUI Create-Command-Report window"},{"15":"Admins can now set an announcement sound to accompany their command reports."},{"0":"The 'anime' announcement line now functions properly again. This is not related to the above changelog line whatsoever."}],"Ryll/Shaps":[{"0":"Fixes some issues with not being able to mount some objects for riding"}],"TheVekter":[{"0":"Material stacks now properly update their material amounts when a stabilized metal extract adds a sheet to them."}],"Trigg":[{"15":"Admins just got a new TGUI Outfit Manager to mess around and make events with!"},{"15":"Custom Outfits are now persistent and saved server-side, but can still be locally saved and loaded."}],"tralezab":[{"5":"Headrevs become enemies of the state when the revolution is over!"},{"5":"Added four new sects to the altar of the gods, for some very unique deities."}]},"11 April 2021":{"Arkatos":[{"13":"Added security level subsystem."},{"0":"Escape pods will now re-lock again properly if security level drops below red."}],"Celotajs":[{"13":"The crew manifest has now been converted to TGUI for lobby, ghost, AI and pAI players."},{"2":"Improved how stat panel items are displayed"}],"Fikou":[{"2":"The Hook Shotgun now shoots its' hook on right click"},{"0":"Fixes sawn-off guns sometimes not having icons"},{"0":"Hooks no longer do magic particles"},{"7":"New sprites for Hook Shotgun"}],"Ghilker":[{"2":"Colorblind users can now examine the atmos components to read on what color they are"},{"0":"fix some ruin runtime caused by the new pipe changes"}],"SuperNovaa41":[{"0":"You can now buckle to mobs again."}],"Thalpy":[{"11":"Adjusts Mannitol,Neurine,Ephephrine,Prohol,Oculine and Inacusate to have their own reaction profiles, purity and impurity effects"},{"2":"Improves the debug reaction tester so that reaction vars can be live edited to make reaction tweaking/creation less of a pain."},{"0":"Tweaks converoli's threshold to not overlap with it's failure threshold"}],"celotajstg":[{"2":"Visual adjustments have been made to the job selection table."}],"ninjanomnom":[{"5":"Canisters when broken will fall in other directions than to the right"},{"7":"Canisters have been unified under a greyscale system"},{"8":"Old canister images have been removed"}],"wesoda25":[{"0":"reborn ash walkers no longer know galactic common"}]},"10 April 2021":{"EricZilla":[{"7":"Added new Gene Sequence Analyzer Sprite"},{"7":"Added new Hydroponics Analyzer Sprite"}],"Ghilker":[{"0":"visual fix for bridge pipe and color adapter"},{"5":"Add a better way to build the HFR with special deployable boxes, set them up in the right position (check the image on each box, it'll tell you where that box should be in a 3x3 grid.. or just examine the box)"}],"Iamgoofball":[{"0":"Fixes a material not spawning on lavaland during April Fools. (Honk related)"}],"Timberpoes":[{"0":"Motorised wheelchairs should now drop all their components when deconstruted or destroyed."}],"maxymax13":[{"7":"Space cash has been resprited, stacks visually show the amount of that bill rather than the combined total, and they come with little roman numerals if you're unfamiliar with the holochip color scheme. Wait, what do you MEAN people can't read roman numerals in 2561? Too late, we've already mass produced them."},{"7":"Pinpointers get unique belt sprites."}],"maxymax13, sergeirocks100":[{"7":"Resprited the Dish Drive!"}]},"09 April 2021":{"ATHATH":[{"11":"Venus human traps no longer take damage from being in a cold environment."},{"11":"Venus human traps now take twice as long to die from being in a hot environment."},{"11":"Shoving someone into a person wearing riot gear will no longer knock the person wearing riot gear down."}],"ArcaneDefence":[{"0":"Elder atmosian armor and helmets aren't flashing error messages now. Facehuggers that infest someone don't become pink/black checkerboards on your face. Chameleon kit monkey mind magnification helmets default to a red light, and if you pick the secborg hailer for your mask you get a tape recorder stuffed in your mouth."}],"Baldies":[{"9":"Minor grammar fixes for aquarium content."},{"2":"empty versions of graves can now be spawned in."}],"Ghilker":[{"2":"Thermomachines can now be moved around. To do this, open up the panel with a screwdriver, then Right-Click on the machine with a wrench, after a delay the machine will be un-anchored; use ctrl-click to move the machine around. Then set the rotation of the machine by Left-Click with a wrench, screwdriver to close the panel, and the machine is functional again."},{"2":"thermomachines can change the piping layer while constructed by hitting them when un-anchored with a multitool"},{"0":"fixed missing plasma mixer from metastation atmos"}],"Seris02":[{"2":"adds assembly activation, voting and pull request messages to the info chat tab, adds a warning chat class to the bomb activation message"}],"SuperNovaa41":[{"0":"You can no longer buckle yourself through walls, air flaps, and a few other things that shouldn't be buckled through."}],"Time-Green":[{"0":"fixes plumbing components letting some reagent holders not properly delete"}],"celotajstg":[{"2":"Ass scans, stamps, UI icons and other .gif and .png images have been optimized to peak efficiency."}]},"08 April 2021":{"Ghilker":[{"0":"layer manifolds visual fix"}],"Imaginos16":[{"9":"Now CentCom cap, french beret and coordinator cap don't have spelling mistakes."}],"IndieanaJones":[{"2":"Player Lobstrosities can now charge using right-click."}],"John Willard":[{"0":"Shaft Miners can now enter Cargo on IceBox, and Cargo techs can no longer enter the QM's office through maintenance."}],"SuperNovaa41":[{"0":"Borgs can no longer shove or harm simple mobs using the hug module."}],"Thunder12345":[{"0":"Pacifists are no longer able to kill bugs with flyswatters. Bugs have feelings too!"},{"0":"Preflight checks have been reenabled on your cargo shuttle, forbidden goods can no longer be shipped to CentComm for sale."}],"tralezab":[{"5":"One headrev is tasked with renaming the station when revolutions are successful"}],"willox":[{"0":"pop-up boxes created by clicking a verb in the stat panel get focused (again)"}]},"07 April 2021":{"ArcaneDefence":[{"0":"Suicidal ethereals are less likely to fail to kill themselves from unexpected revivals trapping them"},{"6":"You can no longer attempt to commit suicide multiple times at once."}],"EOBGames":[{"5":"To celebrate the 100th anniversary of the Battle of LV-426, TerraGov have teamed up with everyone's favourite toy manufacturer, Cuddles Corporation, to produce a limited edition (not really) Runner plushie. Get yours today from Cargo, or your nearest arcade machine!"}],"Ghilker":[{"5":"Smart pipes, simple connection logic, similar to current power cable; place and they will automatically connect (also color dependable, grey is the wildcard that can connect to any colors) add:How these new pipes work. add:-Smart pipes autoconnect to nearby smart pipes add:-They are now color coded, so they only connect to the same colored pipe, the GREY pipe is the wildcard and can connect to every other color, so be aware of this add:-ALL components spawned by the RPD can be colored (from pumps to connectors, from pipes to manifolds), if you leave them GREY they can connect to every other color. Color adapters can be colored, but they'll still connect two pipes with different colors. BUILDABLE machines are GREY (thermomachines, cryo, HFR) so be aware of this add:-Trying to go across another smart pipe will now build a bridge pipe automatically already colored of the color you choose, so you don't have to place it yourself anymore (is still available in the RPD tho) add:-ALL binary components, layer manifolds, color adapters and bridge pipe can be put ONTOP of a smart pipe, but not on another of these. Smart pipes can't be placed on top of these pipes, so you have to build them first. add:-Lcrossings can't be made anymore (sorry y'all i tryed, if someone have a way of doing them ping me on discord) add:-REMEMBER you still have 5 layers to go, these rules apply to the same layer pipes, so if you do a crossing on different layers you won't see a bridge pipe appear."}],"Ryll/Shaps":[{"0":"Blind crewmembers can now use stethoscopes to diagnose faulty hearts/breathing! Deaf crewmembers, on the other hand, are no longer able to."}],"SuperNovaa41":[{"0":"Armless people can no longer buckle others"}],"Thunder12345":[{"5":"View variables can now accept input from a colour picker."}],"Timberpoes":[{"0":"The Roulette Wheel interface should no longer bluescreen for bank account-less ID cards and observers."}],"Time-Green":[{"0":"Smoker negative moodlets now get removed when smoking"}],"bobbahbrown":[{"16":"TGS4 precompile script now installs youtube-dl if it is missing from the host on Linux platforms"}],"maxymax13":[{"7":"Water coolers have been resprited!"}],"tf-4":[{"0":"Removes stray pipe from Icebox cryotubes."}]},"06 April 2021":{"ATHATH":[{"0":"Clicking on a table with a fireman carried person while not in combat mode will no longer cause you to attempt to hurt them."},{"13":"Attempting to right click with an empty hand on someone who is either restrained or both unarmed and not in combat mode while you are targeting the mouth zone will no longer result in you slapping them in the face instead of shoving them."},{"13":"Using the dedicated slapper item (from the *slap emote) on someone while you are targeting either the mouth zone or the head zone will now result in you slapping them in the face instead of just generically slapping them."}],"ArcaneDefence":[{"5":"Chefs can now cook moffins! Yaaay moffins! Check the pastries subsection of the crafting menu to make some! Cutting up gauze and bedsheets can get you started!"}],"BootlegBow":[{"0":"gives tram a chef produce console"}],"Ryll/Shaps":[{"0":"Normal kisses will no longer trigger a shielded hardsuit's shields"},{"0":"Stop me if you've heard this one before: Simple bots should no longer randomly fail to respond to summons even when a path is available"},{"5":"Stripping/equipping things to a conscious braindead person (AKA a human owned by a disconnected player) will now give them a message with your visible name and roughly how long ago you touched their stuff when they login again. Touching someone's pockets or adjusting their gear other than equipping/unequipping is not logged. After 5 minutes, you'll have forgotten both their name and exactly how long ago past those 5 minutes it happened."}],"SweptWasTaken":[{"7":"Better bucket inhand"},{"7":"Omega soap inhand"}],"TheVekter":[{"15":"Added proper logging for Holodeck misuse"}],"vincentiusvin":[{"5":"Crowbarring a firelock is changed a bit. Left clicking will let you open a firedoor and hold it in place! It will close again when you move away, though. Old behaviour is still there, you just need to right-click it."}],"willox":[{"0":"Stat panel no longer captures input (potentially causing keys to get stuck down)"}]},"05 April 2021":{"Ghilker":[{"0":"fix gas deletion exploit by stopping injectors, vents and scrubbers from being placed on walls"}],"Mothblocks":[{"5":"The RCD now has an option to scan the world around you for showing original walls and windows."},{"5":"The RCD will now rebuild existing windows/windows/grilles significantly faster and with less resources."}],"MrStonedOne":[{"11":"april fools is now 3 days long, instead of 5"}],"Swept":[{"0":"stray pixel on vanilla cake slice"}],"necromanceranne":[{"0":"The dark gygax now appears as a dark gygax, and not a gygax."},{"0":"The nukie uplink is no longer deceptive about what equipment you get on a dark gygax."}],"ninjanomnom":[{"5":"Canisters will leak when damaged."},{"5":"Canisters that break while highly pressured will explode."},{"11":"Canister base pressure capacity has been reduced by 8%."},{"11":"Canisters have a hidden pressure capacity that is up to 20% larger than the base labeled max."}],"norill":[{"0":"Fixed air outlet injector outside of Xenobiology Lab not being powered"}]},"04 April 2021":{"ATHATH":[{"2":"You can now print cable coils and welding helmets from science protolathes, engineering protolathes, and ghost role protolathes."}],"Capsandi":[{"0":"Tramstation permabrig has seeds in its garden now"}],"Fikou":[{"0":"fixes lone carpets smoothing"},{"7":"adds back star carpets and symbol carpets"},{"0":"emergency meetings now dont call in mobs with no client"}],"Ghilker":[{"2":"Thermomachine have full temperature range on both modes, plus new automatic thermal regulator function."}],"MrDoomBringer":[{"0":"Emergency meetings work now"}],"SuperNovaa41":[{"9":"bureaucracy"}],"Thalpy":[{"0":"Fixes toxins having unintentional lower purities."},{"0":"Fixes oversight with eigenstasium which teleports you before saving your location (when purity is greater than 90% and ingested)"}],"bobbahbrown":[{"16":"The tgs4 precompile script now builds extools for linux deployments"}],"tralezab":[{"2":"added some helpful examines on food and components for food"}]},"03 April 2021":{"ArcaneDefence":[{"0":"Teleprods do not remind you to install source when worn on the exosuit storage slot any more."},{"0":"Pulse rifles when on your back or in exosuit storage slots show up consistently."},{"0":"Accelerator cannons properly display their charge level when worn and do not become an error sprite when worn n exosuit storage slots."},{"0":"Double barrel shotguns with alternate skins show up properly when in exosuit storage slots."},{"0":"Gluttony's blessing will no longer turn you into a morph if you do not receive the entire volume of the reagent contained in the syringe at once. You weren't supposed to be sharing to begin with, you should've taken a lesson from Greed."}],"Melbert":[{"13":"TGUI Limbgrower"},{"13":"Refactored the limbgrower to modernize the code and allow for more types of designs."},{"5":"Limbgrower design disks. Science now has a new tech node after advanced biotechnology, \"Xenoorgan Biology\" which allows medbay to print new designs for the limbgrower, including various felinid, lizard, plasmaman, and ethereal organs."},{"5":"The limbgrower now supports plumbing ducts."}],"MrDoomBringer":[{"5":"The captain can now sometimes call emergency meetings using the communications console! Hopefully the crew will be able to sus out any imposters who might be among them!"}],"TheVekter":[{"5":"Recently-fired revolvers can now be used to ignite cigars like a fucking badass."},{"5":"Cauteries can now be used to ignite cigars like a very irresponsible doctor."}]},"02 April 2021":{"NamelessFairy":[{"0":"CTF map Cruiser alien rooms are nolonger dark voids"}],"SweptWasTaken":[{"0":"Modified sectech ad line to be more lore friendly"}],"Thalpy":[{"0":"fixes eigenstates letting you get to centcom"}],"bobbahbrown":[{"16":"Fixed missing dependency for libssl1.1 in PreCompile.sh"}]},"01 April 2021":{"ArcaneDefence":[{"0":"Poison moth wings don't have body-shaped gaps in them that show up when dismembered any more."}],"EdgeLordExe":[{"5":"Mansus grasp can now be used to ignite cigars like a fucking badass."}],"Gandalf2k15":[{"12":"autofire code better and healthier for server"}],"Ghilker":[{"0":"Fixed some atmos issues in deltastation, tramstation and kilostation"}],"LordVollkorn":[{"5":"Chemical toxins have been adjusted to the new pH-system."},{"11":"Even if you don't pay attention to pH-values, you can still make relatively decent toxins in small-medium batches."},{"5":"Four new minor impurities have been added."},{"0":"Seiver has been tweaked so pure Seiver is much easier to make now."}],"NamelessFairy":[{"7":"Re-sprites the lightning orb powerup"},{"0":"The lightning orb HUD icon now displays after picking up a lightning orb"},{"0":"CTF map downtown's chairs/stools are now stuck to the floor"}],"SgtHunk":[{"0":"The Internal Affairs gamemode now actually works as intended, getting the target of the agent they just assassinated. Get to work, agents."},{"0":"IAA AIs will no longer always redtext their survive objective."}],"SmArtKar":[{"0":"CTF IDs no longer show message about holder being underage"}],"Thalpy":[{"0":"Adds the missing HPLC to chemistry on tramstation"}],"Timberpoes":[{"0":"Transparent turfs once again work properly."}],"maxymax13":[{"2":"fixes the CTF ghost spawner tip that was outdated before it was even typed"}],"ninjanomnom":[{"0":"Cargo gas canisters can be purchased"}]},"31 March 2021":{"ArcaneDefence":[{"0":"putting a PDA into an exosuit storage slot won't cause the missing texture sprite any more."}],"SmArtKar":[{"11":"Lowered the chance of disease creation by ~60%"}],"Timberpoes":[{"15":"Improved combat and attack logging of spray containers."}]},"30 March 2021":{"AnturK":[{"0":"Antigravity grenades work again now."}],"FernandoJ8":[{"2":"Makes the Hand Drill use sound quieter and less high pitched."},{"0":"Heart failure no longer affects those with the Muscled Veins surgery"}],"Fikou":[{"2":"adds magical passive to battle arcade's examine"}],"Ghommie":[{"0":"The flying damage slowdown movetype no longer affects floating humanoids rather than flying ones."}],"Hideyoshi1":[{"2":"added CTF spawner tip"}],"Mothblocks":[{"0":"Xenomorphs can now strip humans again."},{"0":"Fixed not being able to turn on internals when stripping someone if it was on their back."}],"NamelessFairy, maxymax13":[{"7":"Bluespace gas vendors have been re-sprited"},{"7":"Bluespace gas senders have been re-sprited"}],"Ryll/Shaps":[{"5":"You can now manufacture bone gel by combining 10u of bone dust (obtainable by grinding any organic arm/leg [so no heads/chests]) and 10u of carbon, then heating to 673K."}],"SmArtKar":[{"11":"Holodeck thunderdome armor now has 10 melee and bullet protection instead of deathsquad-tier armor"}],"TemporalOroboros":[{"0":"The light eater will now gnaw the lights off of things you are holding again. Really should have tested this while I was reworking them."}],"Timberpoes":[{"0":"Fixes runtime in turf destruction that could cause transparent turfs to render incorrectly."}],"tralezab":[{"0":"orion emag no longer produces... weeeeird messages"}]},"29 March 2021":{"DuffCreeper":[{"5":"RPDs can now apply the unwrench upgrade by interacting with the upgrade disk"}],"Ghommie":[{"0":"Jungle fevered monkeys are once again dexterous."}],"Guillaume Prata":[{"0":"After investigation. NT found out that Plasmaman detectives were being supplied with \"non-Bangproof\" headsets to decrease expenses because \"The bonehead's helmet protects their bone ears anyway.\" This misunderstanding on how the helmets work has been clarified and the Quartermaster involved was promptly fired."}],"Krysonism":[{"7":"The fork has a new sprite."}],"MLGTASTICa":[{"13":"refactored create_casing_pellets to not sleep"},{"0":"fixed mech hud's not being removed when leaving the mech."}],"Randomguy523":[{"9":"Corrected the span and a typo when a pAI gets emagged."}]},"28 March 2021":{"ArcaneDefence":[{"0":"Spoons are consistently rendered in the correct hand on the player's sprite, rather than floating away from the wielder's hand, or even showing up behind them. You can also see held plastic spoons now."}],"Fikou":[{"0":"fixes jungle grass having wrong broken states"}],"Ghilker":[{"0":"delta station distro and waste no longer mix"},{"2":"atmos components and pipes now show the piping layer on examine"},{"11":"Increased internal heat_capacity of the thermomachine to increase the speed of cooling/heating"},{"11":"Added a check to stop the machine from cooling when set to heater and vice versa"},{"11":"power consumption lowered and efficiency capped"},{"11":"can use enviromental heat even with red port connected and with gas"},{"0":"remove xeno and mid-round antags spawn from atmos tanks from tramstation"}],"Ghommie":[{"0":"The apocalypse rune should no longer invisiblize human mobs from the eyes of non-cultist players."},{"7":"Cyborg charge alerts now use the same icon states as ethereal charge alerts. I also conformally resprited the no cell alert icon state."}],"Guillaume Prata":[{"7":"Moth eyes now have a unique sprite that reflects on your mob. Take care and cherish them, unless you want to look silly."},{"0":"Moth cultists can have their red eyes now."}],"LemonInTheDark":[{"5":"Things that rot will now directly attempt to infect you when you interact with them, remember to wear a mask/gloves. (A freezer will be helpful for long term storage)"},{"6":"Things that rot no longer produce miasma"}],"Mothblocks":[{"13":"tgui tooltips have been moved to a library that should fix them going off the edges of the screen."}],"SgtHunk":[{"0":"Metastation: The nanite lab's request console is now named properly."}],"SuperNovaa41":[{"2":"Even more outdated round tips have been updated. Did you know you can stick a fork into an APC?"}],"Thalpy":[{"5":"Adds eigenstasium, a new reagent that uses the new mechanics in depth!"},{"0":"Fixed a few things to do with reactions on the backend"},{"13":"refactors status effects to have a var for processing speed"}],"Timberpoes":[{"2":"Tourist bots are now significantly less chatty when waiting for a seat and slightly less chatty when waiting to be served their order."},{"0":"AI controller now passes sane delta_time values to AI behaviours."},{"0":"Tourists now get bored and leave after the intended 10 minutes of waiting instead of the unintended 100 minutes."}],"bloons3":[{"15":"Create Antag now allows for a maximum amount of antags to be selected for some options."},{"0":"The already indestructible Syndicate Shuttle Terminal now cannot be deconstructed with tools"}],"dragomagol":[{"2":"sentience fun balloons can no longer assign ghosts to dead mobs"},{"2":"sentience fun balloons only work on mobs without a ckey"}]},"27 March 2021":{"Arkatos":[{"2":"Blobbernauts now have a generic living healthdoll and pull icon."},{"2":"Blobbernauts will now show severity of their injuries as a red screen overlay to the user."},{"2":"Blob core remaining health will now show in percentages and in green color. This affects both blobbernauts and blob overminds."},{"2":"Blob power is now in orange color for blob overminds."}],"Ghilker":[{"0":"fix missing tile under airlock above turbine in kilo station"}],"Kryson, Qustinnus":[{"5":"You can now put food on plates, and plate no longer materialize out of nowhere as you cook"},{"12":"Items no longer appear on a different layer when they're in your inventory, just a different plane."}],"LemonInTheDark":[{"0":"Fixes mined out turfs not sharing gas with their neighbors in a rare case, this most likely only effected one room on tramstation"}],"Mothblocks":[{"13":"The strip panel has been completely remodeled in tgui."}],"Thalpy":[{"5":"Adds the HPLC purifying machine - this machine will indicate the purity of the reagent in it's input beaker and can partially purify selected reagents"},{"5":"Gives each reagent a mass"},{"0":"Fixes the debug recipe machine runtiming when hit by a beaker"},{"12":"Adds alt_click_secondary() which is called when right clicking on things with alt held down"},{"7":"added some more icons for the HPLC"}],"Timberpoes":[{"2":"When examining a player, the large ID card icon displayed in chat is now more compact."}],"Time-Green":[{"11":"Temporarily reverts the changes made to the plumbing reaction chamber untill minichem gets added (never)"}],"cacogen":[{"2":"Paper bins show the paper inside them"}]},"26 March 2021":{"ATHATH":[{"11":"Cyborg treat dispensers now have a maximum treat storage capacity of 5 treats instead of 30 treats, and recharge their treats at a rate of one treat per 10 seconds instead of one treat per second. To compensate for this, the damage of gumballs and lollipops that have been launched from an emagged cyborg has been increased from 3 to 10."},{"6":"Launched gumballs and lollipops will no longer delete themselves after 2 minutes (if not equipped)."},{"11":"The 2u of omnizine in each cyborg lollipop has been replaced by 2u of psicodine. The contents of normal lollipops have not been modified."},{"11":"Cyborg cookie dispensers can now only dispense a cookie once every 10 seconds (instead of once per second). Non-cyborg cookie dispensers no longer self-recharge, but can now accept compressed matter cartirdges for reloading purposes. Support has been added for other types of RSFs to have use cooldowns."}],"ArcaneDefence":[{"2":"Some outdated round tips have been updated, and should hold true to the current state of the game a little better!"},{"5":"Nanotrasen has cut costs on manufacturing station APCs as they no longer have their kitchenware proofing coating. Do not put a fork in an APC."}],"Arkatos":[{"2":"Added new status bar support for more objects that were previously visible in the old status bar, like action buttons."}],"Fox-McCloud":[{"5":"Plant-like mobs are now impacted and take damage from plant-b-gone and weedkiller reagents"},{"5":"Plant-like mobs can be health scanned with a plant analyzer"},{"5":"Plant-like mobs are impacted by the floral gun in the same manner pod people are"}],"Ghilker":[{"0":"fixed deltastation upper atmos missing cable and unpowered airlock"},{"5":"adds use enviromental heat button to thermomachines to let players choose if use enviromental or pipe heat distribution"},{"0":"fix roundstart room heating due to freezer not having gas in the red port on startup"},{"0":"remove double pen door from meta xeno"}],"Horatio22":[{"7":"fixes human feet poking out of envirosuit sprites"},{"7":"gives the ventriloquist dummy a new, animated sprite"}],"MrDoomBringer":[{"0":"Nanotrasen railroad engineers have done some minor repairs to their in-station tram rails."}],"NamelessFairy":[{"5":"CTF can now selects a random map at game start"},{"5":"CTF now supports four teams"},{"5":"Gear for yellow and green CTF teams has been added"},{"5":"CTF ID cards for all 4 teams have been added - courtesy of maxymax13"},{"5":"a new CTF map, Four Side has been added"},{"5":"a new CTF map, Downtown has been added"},{"5":"a new KOTH map, Limbo has been added"},{"5":"a new CTF map, Cruiser has been added"},{"0":"KOTH capture points retain their sprites after being claimed"}],"tralezab":[{"5":"Bane AI"}]},"25 March 2021":{"ArcaneDefence":[{"5":"Hey did you know you can charge your PDA by microwaving it?"}],"Ghommie":[{"0":"modular computers shouldn't leave behind power cells, id cards, or any knick-knack for that matter, anymore when deleted."},{"0":"The experisi arcade experiment is now doable."}],"Kylerace":[{"0":"NanoTrasen & Noble realized that the holodecks ability to replicate books was cutting into its bottom line, so they convinced the branch responsible for the holodeck to patch it out"}],"LemonInTheDark":[{"5":"Adds some windoors and airlocks to better deal with gas movement"},{"5":"Shifts some of delta's areas around, hopefully this reduces mass fire alarm spam"}],"Melbert":[{"0":"Only ghosts can see if something is deadchat controlled. Humans are no longer clairvoyant."},{"0":"Plant trash from grown foods (banana peels) now inherit their parent plant's traits properly again."}],"Ryll/Shaps":[{"0":"AI dogs holding onto something in their mouth will drop them upon death"},{"0":"Corgis and pets in general are better about dropping equipped items when gibbed rather than deleting them"}],"Time-Green":[{"5":"Adds a plumbing layer manifold"},{"2":"Alt-click the plumbing RCD to change the creation layer"}],"tralezab":[{"13":"highlander + summon guns and magic are refactored"}]},"24 March 2021":{"ArcaneMusic":[{"0":"The interrogation room is now it's own distinct room, with an air alarm and APC like everything else, as opposed to being blobbed together with the rest of the brig."}],"Arkatos":[{"12":"Added right-click support to AIs and cyborgs. Cyborgs can use right click actions only if they do not have any tool selected, as to not conflict with the right click actions of the items themselves, like syringes."},{"0":"Silicons are now once again able to start a wash cycle due to newly added right click support."}],"Ghommie":[{"5":"Sundae, honkdae and space freezy can be filled with ice cream from the ice cream vat."},{"5":"Ice creams cones, as well as the aforementioned treats, can hold multiple servings of ice cream now, up to three."},{"13":"All because ice cream has been refactored into a component, and its flavours made into datums."}],"JohnFulpWillard":[{"7":"The Flyperson left leg has been given an extra pixel"}],"MLGTASTICa":[{"0":"fixed mech bullets hitting the mechs they're fired from"}],"Ryll/Shaps":[{"0":"Immovable rods triggered by admin intervention will no longer miss everything in their path"}],"TheVekter":[{"0":"Ghosts should now be able to view the crew monitor console."}]},"23 March 2021":{"Fikou":[{"0":"fixes mouse override icon on supplypod launchers"}],"Ghilker":[{"11":"READ ME thermomachines now have 2 ports, the green one is used as you normally do, by cooling/heating the gases connected to it, the red port is optional but it helps move the heat from the green port to the red one (and vice-versa), if no pipe is connected to the red port or there is no gas in it, the heat will be moved from the enviroment;"},{"11":"ALL the station freezers are now connected to the waste loop, where the CO2 gets collected and used to store that heat (atmos should now manage the waste pipenet more actively);"},{"11":"the best way to now use freezers is to connect their red port to the waste system (there is at least one pipe in every room)"},{"11":"Rotate the machine without emptying the content will release the gas onto the atmosphere"}],"Ghilker, tralezab":[{"5":"Add gas vendor and gas sender. The gas sender is located on round start in atmos, it has a port where you connect pipes to send the gases you want into the bluespace gas network. To this machine will connect gas vendors (or you can multitool the sender and then the vendor to do the connection), the vendors are wall mounted tank dispensers where you can decide you gas mix based on the input in the UI. The gases are not free tho (unless the atmos man that is managing the sender just set them free), you will have to pay a sum based on the gas price times the gas amounts, the sum will be taken from your card and sent to the engi department."}],"Guillaume Prata":[{"7":"New bio hood sprites."}],"Melbert":[{"0":"Toilets now drop their cistern contents on deconstruction."},{"0":"Some worn things that previously used to be slippery are now properly slippery again."},{"12":"Slip component can be given a whitelist of valid worn slots. (B)Admins can now make anything worn slippery, again."},{"15":"Midround Syndicate Sleeper Agent is now logged and messages admins when triggered."}],"Mothblocks":[{"0":"Security officers now only get PDA'd if the new member is of the same department."}],"Ryll/Shaps":[{"0":"Simple bots should no longer randomly fail to respond to summons even when a path is available"}],"Thalpy":[{"2":"restores drink mixing speeds back to what it was (or slightly faster)"}],"Timberpoes":[{"0":"Admins can once again open the stat panels to look at active, disconnected, closed and resolved tickets."},{"0":"Admins should no longer be triggered by simple bots creating Captain's Spares in nullspace."}],"TiviPlus":[{"12":"Cleaned up scooter/skate code"}],"Y0SH1M4S73R":[{"0":"Corrected a manufacturing defect in mind magnification helmets that allowed them to remain on the subject's head after humanization."}],"bloons3":[{"15":"Added semi-verbose logging to brig timers"}],"dragomagol":[{"0":"fixes icebox's json file referencing a non-existing area"}]},"22 March 2021":{"ArcaneMusic":[{"0":"You can no longer make infinite money off of some cargo crates improper sell values."}],"CRITAWAKETS":[{"5":"Central Command has a new closet for if the announcement system breaks. They stuffed an intern in there, he should be fine."}],"Cimika / Kathy Ryals":[{"15":"Added the ability to call a N.E.R.D. (Nanotrasen Emergency Response Drone) team in the create antagonist verb."}],"Fikou":[{"0":"fixes getting nothing from necropolis chests"}],"Fikou, Rohesie, Ryll/Shaps, MrDoomBringer":[{"5":"Full-Automatic Gun component! Your L6 Saws and Laser Gatling Guns have it now."},{"5":"The Tesla Cannon! A fully automatic replacement to the tesla revolver, it shoots balls of shock."},{"12":"Makes the Laser Gatling Gun less bad."}],"GuillaumePrata":[{"2":"Atmos tech powercreep. Engineering wintercoats can now hold a gas analyzer like Science ones can."}],"Hadza":[{"11":"Reverts the TK range for movable atoms (machinery, lockers, crates) from \"as good as removed\" back to useful"}],"Mothblocks":[{"5":"Security officers are now paired up into departments together, rather than separated."},{"5":"DeltaStation now has departmental security officer spawners."},{"0":"Fixed MetaStation's science officer being marked as supply."}],"Qustinnus":[{"0":"Fixes being on a drug not stopping the effects of withdrawal when you're addicted"}],"TemporalOroboros":[{"12":"Gas tanks now use object integrity rather than their own snowflaked version."},{"0":"Bomb spawners now produce functional bombs. tweak: Tanks are no longer self-sealing."}],"dragomagol":[{"0":"The Tram Emergency Shuttle brig now has a brig area instead of its usual area for escape checking"}],"jlsnow301":[{"5":"New TGUI Vote Panel"},{"5":"Users can now change votes after voting."}],"ninjanomnom":[{"11":"All gas prices have been standardized and based on a single base value, this has resulted in some fluctuations in the purchase price of various gases."}],"zxaber":[{"9":"Restaurant customer bots no longer list imaginary countries in their names"}]},"21 March 2021":{"Arkatos":[{"2":"Stack splitting now uses right click."}],"Fikou":[{"6":"removes medkit from ert engineer"}],"Ghommie":[{"5":"Expanded the list of orderable objects for space-italian and space-french customer bots."}],"KathyRyals":[{"0":"Can pull things as a simplemob with ctrl click again."},{"13":"Refactored /mob/living/CtrlClick(mob/user)"}],"LemonInTheDark":[{"0":"Tramstation should lag a bit less when you drive the trolley around for fun and profit"}],"Mordent":[{"12":"Allowed tgui interfaces to be created in subdirectories"}],"MrDoomBringer":[{"0":"Did you know defibs can be manually attached to medical cyborgs? The description of defibrillator now reflects this fact"}],"TiviPlus":[{"13":"Changed how cars handle some things"}],"Tralezab, Qustinnus":[{"5":"The Robot Earth Tourism Program has expanded, bringing in the polite British-Bots, who are hungry for some food that reminds them of the Empire. Bot Appetit!"}],"dragomagol":[{"2":"Borg model selection is now done by radial menu"}],"stylemistake":[{"0":"Swapped OK/Cancel buttons in tgui list input, so that it stays consistent with Windows UI guidelines (was Cancel/OK before)."}],"tralezab":[{"0":"a lot of addiction bugs, especially with nicotine"}],"zxaber":[{"0":"AIs piloting a shell when the round ends will now correctly have their laws shown on the round-end report."}]},"20 March 2021":{"Arkatos":[{"2":"Washing machine now uses right click to start a wash cycle."}],"Ghilker":[{"5":"the HFR now supports different gas mixtures as fuel, the GUI has been updated with the necessary informations, it will also show what gases will be produced."},{"11":"tweaked how the HFR takes damage, made it easier to maintain at high power levels and much easier to repair"}],"Krysonism":[{"7":"The spoon has a new  sprite."}],"Kylerace":[{"0":"the holodeck is no longer so powerful that it can destroy anything and everything that dares to start existing while it's busy loading programs"}],"MLGTASTICa":[{"0":"fixed people being able to remotely eject out ID cards from bounty consoles"}],"SuperNovaa41":[{"0":"Allows you to wash away your shameful pied face"}],"Sylphet":[{"6":"Removed toasted sandwich"},{"2":"Grilled cheese sandwiches are now made on the griddle using a cheese sandwich."}],"Thalpy":[{"0":"fixes helgrasp's lag compensator and text"},{"2":"Sets helgrasp to fire faster but last shorter"}],"Timberpoes":[{"0":"Mulebots no longer murder people just because that person dared to bump into them."}],"Trigg":[{"15":"The Outfit Manager now updates the Select Equipment menu when an outfit is created or deleted"}],"zxaber":[{"5":"You can now download a cyborg's internal logs by right-clicking them with a mobile device running SiliConnect. Take a look if one is acting a bit strange, you might find something interesting."},{"5":"Borg integrity (health) is now roughly shown in SiliConnect, under \"Condition\"."}]},"19 March 2021":{"Horatio22":[{"7":"Changed the height and width of enviroslacks, clown and mime envirosuits to be consistent with standard envirosuits; fixed a couple coloring mistakes with centcom and captain uniforms"}],"Mothblocks":[{"6":"Remove the voodoo doll."}],"Thalpy":[{"0":"Fixes impurities on foam, smoke and cigs."},{"12":"Improved how impurities are handled"}]},"18 March 2021":{"ATHATH":[{"0":"Fixes the goof(s) made in another coder's anti-spider plasmaflooding PR that rendered silicons unable to interact with many machines."},{"2":"Admins with \"ai interact\" mode on can now interact with any machine that is powered and not broken, regardless of other conditions, provided that the default machine can_interact() proc hasn't been overwritten in a weird way for that machine."},{"12":"The structure of the default state of the can_interact() proc for machines has been reworked to be less awkward and painful to read than it was before."}],"ArcaneMusic":[{"0":"You can no longer use the BEPIS to rob the cargo budget blind. It now auto-starts depending on the attempted deposited credits."}],"Arkatos":[{"0":"Fixed juggernaut transformation option doing nothing."},{"0":"Fixed artificer transformation option doing nothing."},{"0":"Fixed adult slime transformation option doing nothing."}],"Fikou":[{"0":"fixes the ancient bundle not working at all"},{"11":"You can no longer sentience potion humanoid simplemobs"}],"Maurukas":[{"2":"IceBox's mining mech bay has moved to the east of the cargo warehouse"},{"0":"A number of anomalous floating decals and air alarms inside doors have been in the Icebox mining base"}],"Sylphet":[{"2":"changed berry ice cream sandwich and cornuto to use ice cream cone for consistency"},{"0":"fixed broken ice cream recipes"}],"TheBonded":[{"5":"Jade lanterns can now be found in the black market uplink"},{"5":"Added the chainsaw and switchblade to the list of items available in the black market uplink."}],"TheVekter":[{"6":"Removed the admin snowflake rocket launcher foam finger. The toy one is still around."}],"Timberpoes":[{"0":"Fixes oversight in DNA Consoles where doing a transfer from the Genetic Makeup tab had no cooldown and could be spammed to massively irradiate things."}],"TribesChen":[{"5":"Rocket boots, a bad idea from the black market that hurls you 20 tiles in the direction you're facing. Beware of walls and people."}],"necromanceranne":[{"6":"Removes 9x19mm as an ammo type."},{"11":"PP-95's (the surplus gun for nukies) now use 9mm. They also have a .35 damage multiplier, resulting in standard 9mm doing only 10.5 (9x19mm did 10, so not really much of a difference)."},{"0":"Properly aligns the xenobio bloodgun with the arm when facing to the side."}],"sergeirocks100":[{"5":"Malt liquor is now available in the booze dispenser."},{"11":"Reduces the price of malt liquor in the Booze-O-Mat to give some reason to buy it over other equally priced drinks that are stronger."}],"tralezazelart":[{"12":"Orion code maybe less shit?"},{"13":"Orion Events use datums whew"}]},"17 March 2021":{"ATH1909":[{"0":"Gorillas (and dextrous holoparasites) can now SMASH walls, windows, tables, etc. while in combat mode, as they were intended be able to."}],"ArcaneDefence":[{"0":"Pay stands won't accept funds from the cargo budget."}],"ArcaneMusic":[{"9":"Blood Filtration wording is better & spelled correctly."}],"Ryll/Shaps":[{"0":"The station integrity score no longer over-penalizes burnt or missing floor tiles in the shift-end report."}],"Trigg, stylemistake":[{"15":"Admins just got a new TGUI Select Equipment menu"}],"carshalash":[{"2":"Breakfast is less eggy. Boiled rice and Milo soup are both breakfast items."}],"vincentiusvin":[{"13":"Refactored ventcrawling code. No expected behavior changes except for a few texts and the ability to crawl with passive vents."}]},"16 March 2021":{"Fikou":[{"12":"rsf can now have a custom icon, no longer deletes stacks instantly"}],"Ryll/Shaps":[{"0":"The admin button to change everyone's species no longer makes everyone a traitor"},{"11":"Vending machines can no longer by thrown via TK"},{"0":"Admins lacking +BUILDMODE privs can no longer launch buildmode from the supplypod panel"}],"SuperNovaa41":[{"0":"fixed hat sprites duplicating when being thrown"}],"TiviPlus":[{"13":"Changed how mechs handle movement and other cleanup"}],"tralezab":[{"5":"A new, incredibly rare bot is in the pool."}],"vincentiusvin":[{"0":"Nondextrous simplemobs can no longer interact with atmos machineries using hotkeys."}]},"15 March 2021":{"ArcaneDefence":[{"5":"Clown cars are now fitted with functioning headlights! Emag them for some more high speed low drag variants!"}],"Fikou":[{"9":"the clockwork defenders name now isnt brkoen"},{"0":"fixes map template loading centering setting not actually mattering"}],"Ghilker":[{"11":"buffed space heater to have double power (from 20000 to 40000 at t1), every tier has been doubled in power as effect"},{"13":"refactored construction code to use subtype instead of deleting old cell on construction, changed attackby to use default procs and early returns"},{"12":"added documentation and variables with snake cases"},{"11":"rebalanced crystallizer recipes to a better use of the energy released to actually have an impact, healium crystal and proto nitrate crystal will create a bit more n2 on rupturing"},{"11":"tweaked the costs of some recipes of the crystallizer for more sane productions"},{"2":"changed the cooling and temperature control on the crystallizer and the UI now have the temperature bar"}],"Ghommie":[{"0":"sweet potatoes and potato wedges no longer output tator tots instead of yaki imo or french fries when processed through the food processor. Same deal for various kinds of meat slabs or cutlets outputting generic meatballs."},{"0":"Non-admin observers can now use emoji that start with d or p at the beginning of a deadchat message without admin command warnings."}],"Melbert":[{"5":"Adds a negative station trait: Bot Language Matrix Malfunction. Is Beepsky speaking nekomimetic...?"},{"0":"The \"Slow Shuttle\" station trait is now properly classified as a negative trait instead of a neutral trait."}],"Mothblocks, MrDoomBringer for sprites":[{"5":"Adds moth tourist bots for chefs."}],"SuperNovaa41":[{"0":"fixed neckerchief not being able to be put into your bag"},{"0":"Fixes crippled non cultists being able to use cult bola"}],"TheVekter":[{"11":"Centcom is now only paying 100cr/mol for Zauker, down from 1050."}],"Timberpoes":[{"0":"Fixed various issues with the cyborg beaker apparatus code. These fixes mean it should now properly update its own icon when reagents are transferred to any beaker it is holding."}],"TiviPlus":[{"12":"Minor wheelchair tidying"}],"VexingRaven":[{"0":"Paramedics now have access to Cargo Office on Ice Box, lost access to Delivery Office on MetaStation."}],"carshalash":[{"0":"fixed a single letter naming issue"}],"oranges":[{"11":"Chance to mutate a monkey into a gorilla is greatly reduced"}]},"14 March 2021":{"Ghilker":[{"0":"fixed delta station atmos from power failing in 5 minutes from roundstart"},{"0":"Fixed machine frame stacking with disposal system"}],"Ghommie":[{"0":"twohandend-required items shouldn't fall down when equipped on another slot."}],"Kekium":[{"5":"You can now craft warning cone from plastic"}],"LemonInTheDark":[{"0":"Gas will actually dissipate now. Screee at me in the issue reports if you see jank around this or breathing (Please don't ask)"}],"ModDownloading":[{"5":"Added lizard scream sound effects, because that's exactly what we need."}],"Mothblocks":[{"0":"Mouse hover outlines will now only show if the item is on your person."}],"Potato Masher":[{"0":"Taking Metastation's delivery chute to science and service should no longer cause bone fractures."}],"TheBonded":[{"5":"Clear PDAs can now be found for sale in the black market occasionally."}],"Timberpoes":[{"11":"The Cook's CQC is now set on a per-map basis, with their CQC covering their own private workplace (the kitchen and freezer) as well as the area where their tourist bots spawn. These changes also give cooks the ability to CQC a restricted area directly outside of their public service tables on Icebox, where the tourist bots spawn."}],"TiviPlus":[{"0":"fixed bad copypaste making atvs not spark like they were supposed to"},{"12":"Wheelchair icon updates are now cleaner"}],"necromanceranne":[{"7":"Makes the ID sprites (ID, PDA, Tablet) less intrusive while still visible on the mob sprite."}],"prodirus":[{"0":"Nicotine is addictive again."},{"5":"New nicotine withdrawal effects. Time to feel miserable and jittery if you don't get your fix!"}],"sergeirocks100":[{"0":"The glass of beer now uses its unused icon."}],"spessbro":[{"0":"stops people from buying from custom vendors using departmental cards"}],"tralezab":[{"0":"Ghost pool protection now updates when you hit a button"}]},"13 March 2021":{"ArcaneMusic":[{"0":"Spanish tourists now have the correct chance of spawning."}],"Fikou":[{"15":"map template placing being centered is now a selection"}],"Ghilker":[{"0":"payment now consider extra fees"}],"Qustinnus":[{"0":"Fixes the critical issue of players not being able to anchor griddles"}],"Timberpoes":[{"6":"The Chameleon Skillchip has been removed from the game entirely."}],"dawsonkeyes":[{"5":"New metal hydrogen armor sprites"}],"drongood12":[{"0":"Helbital is properly eliminated with a dirty reaction"}],"maxymax13":[{"5":"Items in your inventory now have an outline when you hover over them, originally from BeeStation. This can be disabled in Game Preferences."}],"sergeirocks100":[{"7":"The bank machine has had a makeover to put it in line with the rest of the terminals."}]},"12 March 2021":{"ATHATH":[{"11":"Rabbits summoned by stage magic will start with 0 loaded eggs remaining instead of 10. You can still feed them carrots to cause them to generate more loaded eggs, though."},{"11":"The speed boost from wearing the Easter Bunny head and/or the Easter Bunny suit has been nerfed, but is still present."}],"Fikou":[{"11":"ninjas can now hijack the shuttle"}],"Ghilker, Anturk":[{"0":"fix pipes overlays when on layer other than 3"}],"Ghommie":[{"13":"refactored the voice of god. Specifically, I made the commands into singleton datums. It's also more robust against edge cases and bad text matches."},{"0":"The voice of god spell should now work for AIs."},{"2":"the voice of god commands themselves should tolerate the lack of whitespaces now."},{"6":"Animals are no loner n(e)igh-immune to stuttering."},{"0":"Silicons and animals won't keep stuttering or slurring forever after being struck by something that made them like that in the first place (such as a Blue Space Artillery)."},{"0":"Fixed the manhattan project reagent having two pound signs in its color variable."}],"Kathy Ryals & Timberpoes":[{"0":"Pens now alert the stabbed person again."},{"13":"Refactored attack() code pens and sleepypens."}],"Kush1Push1":[{"2":"Blood splatters only make your shoes or feet bloody if the tile is bloody enough,"},{"2":"Light steps trait prevents clothing from being covered in blood if you step on a bloody tile with your shoes off."},{"5":"Blood dries over time. Usually, 3 or 6 minutes. If a splatter is big enough, it can stay wet up to 15 minutes."}],"Kylerace":[{"0":"holodeck templates no longer have two entries each in the Template - Place verb"}],"MMMiracles":[{"5":"Adds a brand new map - Tramstation"},{"5":"Three segmented branches inter-connected via a transit system"},{"5":"2 z-levels, with the lower being interlaced with maintenance tunnels to traverse the entire station through various ladder shafts and tram tunnels."}],"Mothblocks":[{"0":"You can no longer alt-click and ctrl-click while inside the cryo tube."}],"Randomguy523":[{"9":"Fixed a typo for muted pAIs."}],"Ryll/Shaps":[{"0":"Dogs are no longer able to maul you from inside backpacks or lockers. Unless they're void corgis, those pups are still more than capable of doing so!"}],"Thalpy":[{"2":"adds a wiki render button for reagent entries that will automatically write a table entry for you."}],"Timberpoes":[{"0":"Food that should drop trash should now always drop that trash, including plates dropping from prepared food, food that you have to pull out of shells and gatfruits."},{"0":"Agent ID cards now show the same SecHUD icons that their forged trim otherwise would instead of always showing as blank."}],"Y0SH1_M4S73R":[{"2":"Pulsing a cut open wire on airlocks will now open it. Since cutting the open wire prevents airlocks from being opened by physical contact, this allows you to make airlocks only openable using assemblies. Try connecting a voice analyzer to the cut open wire."}],"Zytolg":[{"0":"We've untangled some pipework that lead to Kilostations scrubber network feeding into the Xenobiology Air Distribution Loop"}],"esainane":[{"0":"The Atmospherics Crystallizer will no longer do wacky things with an empty recipe when \"Nothing\" is selected."}],"nianjiilical":[{"5":"Sentient Diseases can now talk to themselves, and hear what the salty-ass ghosts of their victims have to say about their experiences with Space Ebola."}],"prodirus":[{"0":"Jumpsuits should now drop attachments such as medals or ribbons when they are destroyed instead of making the attachments disappear as well."}]},"11 March 2021":{"Arkatos":[{"11":"Removed extra brute healing from Quadruple Sec drink for security personnel."},{"11":"Removed extra brute, burn, oxygen and toxin healing from Quintuple Sec drink for security personnel."}],"Ghommie":[{"5":"There is a new (backup) centcom announcer in town."},{"0":"Uranium, bananium and bluespace golems and ethereals now properly show visual attack effects on do_attack_animation()."},{"5":"simple animals can now have their own visual attack effects instead of just punch or smash. e.g. carps bite and hivebots claw."},{"7":"the slash attack effect now has a sprite."}],"LemonInTheDark":[{"13":"Things that break pipes will cause much less game lag now. Looking at you singularity"}],"Qustinnus":[{"0":"Fixes Pwrgame icon not appearing"}],"Zytolg":[{"0":"Icebox Pipework Decongestion"}],"necromanceranne":[{"0":"Prevents martial arts warping people that they can view into their killing hands with the power of their martial prowess. And a missing adjacency check."}],"nightred":[{"0":"Meta: Camera tags, wiring, power, and plumbing inspection completed and brought up to code."}],"prodirus":[{"0":"Prevents Tranquility from being synthesized. No more appearing in botany plants!"}],"tralezab":[{"0":"bane back breaker fixed"},{"5":"Chefs and bartenders earn achievements for doing a good job!"},{"5":"Centcom now grades service at the end of a round."}],"wesoda25":[{"0":"Ethereals can once again channel power into APCs. Right click an APC with an open hand off of combat mode to do so (and to drain, do it on combat mode)."}]},"10 March 2021":{"Ghommie":[{"0":"Fixed material exports reporting 1/2000th of the amount of material exported."}],"Iamgoofball":[{"11":"Chef CQC now works in all of Service, to curb greytiding the robots."}],"Krysonism":[{"7":"The butcher's cleaver has a new  sprite."}],"LemonInTheDark":[{"0":"Large singularities won't get clipped by darkness anymore"}],"Lylsburg":[{"7":"mafia sprite tweaked, and it now has an animation"}],"Qustinnus":[{"2":"Chefs and bartenders can rest easy now that robot tourists will no longer allow themselves to be bullied, and will use their bulky metal arms to give their aggressors are healthy dose of LOVE in form of a very tight hug."},{"5":"New station trait that causes you all to spawn hungover after a mandatory office party"}],"That REALLY Good Soda Flavor":[{"0":"A bun will no longer disappear if you add an ingredient to it while it is in your hand."},{"0":"Custom burgers will no longer disappear from adding too many ingredients."}],"Timberpoes":[{"0":"PDA & ID Painter no longer talks about itself so much in warning messages."},{"0":"PDA & ID Painter will now correctly paint Assistant trims and clown PDA skins instead of failing in certain edge cases."},{"2":"Stat panel and verb tabs now have smoother size scaling to higher resolutions, switching from fixed-width buttons to a fixed number of variable-width columns depending on screen resolution."}],"esainane":[{"0":"The atmospherics Crystallizer will now slowly improve the quality of items that will be produced while the temperature remains in the sweet spot, rather than instantly degrading to the worst quality."}],"spessbro":[{"13":"refactored dragging to pick up into an element"}],"stylemistake":[{"2":"Stat panel: Verbs no longer wrap, and truncate with an ellipsis. All verb text is revealed on mouse over."},{"2":"Stat panel: Nicer tab appearance in dark mode."},{"0":"Stat panel: Fixed 4 column layout in 1920x1080 + widescreen map."},{"2":"Status Bar returns in an epic cumback."}],"tralezab":[{"2":"chanterelle mushrooms and chocolate are now in the produce console"},{"5":"adds a windoor to the bar, and a door to the kitchen to allow access to the atrium"},{"5":"opens the kitchen up a bit more"},{"0":"tourists now sit facing the bar on delta"}]},"09 March 2021":{"ArcaneMusic":[{"0":"Fixes some duplicate air alarms on kilostation."}],"Ghilker":[{"2":"lowered the grav gen sound a bit to stop IRL blood loss from ears"}],"Ghommie":[{"0":"The xenobio exports file are now included in the .dme, which means xenobiologists can exports slime cores to cargonia if they wish to again."}],"Guillaume Prata":[{"0":"Remove a comment on the plasmamen security helmet falsely claiming that they protect against flashes, hopefully no more Officers will have their helmets looted at medbay."},{"5":"Added a new ocky icky phobia, careful while talking about amongus now!"}],"LemonInTheDark":[{"6":"Removes the upgraded hydrogen axe"},{"11":"Portable scrubbers are 4x stronger now. This was a bug, but I've got gbp to burn"}],"Maurukas":[{"0":"Corrects the wiring of the Metastation telecomms SMES so that the station powers the satelite, rather than the reverse."}],"Qustinnus":[{"11":"Robotourists pay more for food now"},{"2":"Only one robo-tourist will wait at the door at any time, preventing constant spam if you only have 2 seats."},{"2":"more variation in robo-tourist colors"}],"Ryll/Shaps":[{"5":"ERT Medical Officers now come equipped with a box of plushies to give to crewmembers in crisis"}],"Timberpoes":[{"15":"Spells now ask you if you want to make them robeless in VV when adding spells. Forcing robeless means the spell can be cast without cult armour or spellcasting robes."},{"15":"Spells have new options in VV to toggle some of the most common spell behaviours including robeless casting, cult robeless casting, whether the spell requires a humanoid mod and whether the spell requires a physical body and cannot be cast by pAIs and brain mobs."}],"Time-Green":[{"0":"Reaction chambers properly cool/heat during reacting"},{"0":"Reaction chambers properly add buffers during reacting"}],"Tlaltecuhtli":[{"0":"glass bottle smashes on right click"}]},"08 March 2021":{"ArcaneMusic":[{"5":"There are now space tourists from south of the border. Andele!"},{"2":"The two taco recipes are now distinguished by name in game to help tell the two apart."},{"7":"The Restaurant Holoseat Creator now uses a slightly different sprite to help it stand out."}],"Fikou":[{"0":"fixes cayenne being invincible"},{"2":"adds the jumpsuit variants of skirts to the curadrobe"}],"Fox McCloud":[{"5":"His Grace now sounds like a toolbox when picked up/set down"},{"0":"Fixes His Grace in-hand icons not updating when he ascends"},{"5":"Windup toolbox has more *immersive latch snapping toy action™️*"}],"Ghilker":[{"0":"plastic flaps now properly update their behaviour when un-anchored and update the turf they are on so that gases can pass"}],"Mothblocks, Fikou for icon":[{"5":"The Jump to Mob button has been replaced with Spawners Menu."}],"Paxilmaniac":[{"5":"Directional subtypes to common wall mounts for mapper use"}],"Ryll/Shaps":[{"5":"Dogs now have all-new AI! Go throw a grenade at Ian and see what happens!"},{"5":"Added AI datum support for complex JPS pathing"}],"SgtHunk":[{"9":"The snowman head's name is now full lowercase."}],"That REALLY Good Soda Flavor":[{"0":"Fixed issues with monkeys unable to attack with martial arts."},{"0":"Fixed issues when using martial arts against an alien."}],"Timberpoes":[{"5":"Centcom ID consoles have extended template support."},{"0":"ID cards with no registered age will no longer show null age in Plexagon Access Management."}],"mozi_h":[{"2":"Carbon-copies can now only be removed with a right-click. HoPs, you are welcome (yet again)!"}]},"07 March 2021":{"Dennok, Fikou, Armhulen":[{"0":"Fixes shuttle decals not working"}],"Fikou":[{"15":"Buildmode now respects your dir for turfs"}],"Ghilker":[{"0":"fixed malf AI overload ability from blowing up non-machine atmos devices (like pipes) and the HFR"}],"Ghommie":[{"0":"Hieroclub teleportation now respects unteleportable mobs such as anchored AIs and megafauna."},{"0":"Space Dragons are now actually capable of flight."},{"0":"Fixed the E/W sprites for durathread golems' legs being a couple pixels off."}],"Paxilmaniac":[{"0":"The slightly pixel shifted decal next to chemistry is no longer pixel shifted"},{"0":"The several windows that spawned on top of walls in cargo no longer do this"}],"Qustinnus":[{"0":"If you get qdeleted while crystalizing as ethereal, you no longer get super-owned"},{"13":"makes the game screen bigger by removing the status bar and moving the chat bar"}],"Randomguy523":[{"5":"pAIs can now be emagged"}],"Ryll/Shaps":[{"0":"The foam finger rocket launcher will no longer make 5000 rockets and freeze the server when spawned"}],"SgtHunk":[{"0":"Kilostation's security office is no longer haunted by a red siding in one of the security office's tiles."}],"Sparkezel":[{"0":"Veil fluctations returned to normal values, cult can once more place runes in maintenance and few other areas and blob has lost its aversion to books."}],"StoneMason / Dwight Walker":[{"2":"Chav is now closer to being an actual Chav"}],"Thalpy":[{"0":"fixes organ exploits with impure libitoil and convermol"},{"2":"Improves the chemical analyser to give you details on impurity and gives an % output in line with other purity descriptions"},{"0":"fixes Multiver's purity effects"}],"Timberpoes":[{"0":"Fix bug that prevented admins toggling playtime exempt status on accounts."},{"0":"Agent ID cards no longer wipe their own access when Reset."},{"5":"Comms Consoles now have the ability to request codes to the spare ID safe when there are no crew members in the chain of command on the shift. This can be done without logging into the comms console."}],"Zytolg":[{"0":"Wall/Floor Lattice cleanup."}],"carshalash":[{"5":"Carbonation"}],"maxymax13":[{"5":"The Syndicate's tech engineers have minorly modified the wiring on their sequencers to not obstruct the ID card clip on jumpsuits, letting you tell the whole station how much of a traitor you are."},{"5":"You can also show them off like you can regular cards, in case the space bar asks for ID."}]},"06 March 2021":{"Dex":[{"0":"Juice boxes no longer turn into paper cups."}],"Dorsisdwarf":[{"15":"Admins can now see who sent a cross-server message and from where"}],"Fikou":[{"5":"Cayenne can now pick up the nuke disk."}],"Ghilker":[{"0":"fix multiz adapters, now they work on the same tile with different pipe layers and they keep the pipelines separated and sprite fix due to layer 1 and 5"},{"0":"thermomachines can't be built on same layer pipes"}],"SuperNovaa41":[{"9":"fixed a spacing issue"}],"Timberpoes":[{"0":"Departmental sec officers now appear on the crew manifest as sec."},{"0":"The new ID card system no longer ignores server config settings and will respect lowpop/highpop access settings in the config. This mean that highpop shifts no longer grant players lowpop access levels when the appropriate config entries are set."},{"14":"As I am happy with the status quo, the headmins have agreed to disable the config entry that was being ignored due to the above bug. Players should not notice any new roundstart ID access changes by the time they're reading this changelog entry and will hopefully start with maximum job access at any population level because it is intended, rather than because of a bug."}],"tralezab":[{"11":"sashimi pays waaaaaay less"}]},"05 March 2021":{"ATHATH":[{"13":"The definition of the transfer_blood variable (of gloves) has been moved from the file that otherwise only contains the code of damp rags to the file that defines the other variables of gloves, and has also been documented."},{"11":"Radioactive microlasers can no longer knock out creatures who are immune to the effects of radiation."},{"0":"The radioactive microlaser now calculates the strength of its delay effect using the intensity setting it had when you initially used it on your victim, not the intensity setting it currently has. This prevents people from \"cheating out\" its intensity 20 effect with only a 2 second delay and a 1 second cooldown."},{"11":"Radioactive microlasers no longer contain twice as much metal as normal health analyzers do."}],"ArcaneDefence":[{"0":"Monkey kind has rediscovered the lost art of wearing a pet collar. Celebrate with Pun Pun!"}],"ArcaneMusic Ft. Ghost":[{"5":"Scanner gates now have a set of wires that interact with assembly components. Experiment!"}],"EdgeLordExe":[{"5":"Adds a new system for handling organ failure, the old system is still there for organs that havent been ported yet."},{"5":"Liver is now using the new system for organ failure, which means that once it reaches 100 damage (liver is dead) it will give you a 1 minute warning period for you to get to medbay, after that 1 minute the effects of liver failure will slowly ramp up to comparably old levels of deadliness."}],"Foxtrot (Funce)":[{"0":"Restaurant and Bar Holosigns are now buildable in the Service Protolathe."}],"Ghilker":[{"0":"fix piping layer not being set, now it works, also UI value fixed for moles/s intake"},{"0":"fixed blast doors and shutters stacking exploit"}],"LemonInTheDark":[{"0":"Hello lads, atmos has changed again, actually instant settling of say plasma over large spaces should be much less common, and if I've done my job right things should seem a bit more snappy"}],"Melbert":[{"0":"Meteor events now announce themselves properly again"},{"0":"Crafted foods now inherit their component food's reagents again."}],"Ryll/Shaps":[{"0":"Firing guns no longer runtimes"}],"SgtHunk":[{"0":"The Deltastation wall-mounted flash at the Brig entrance is now properly connected to the Brig Checkpoint flasher button."}],"Thalpy":[{"2":"Tweaks cryostylane to use the new reaction mechanics, incorporating stasis iceblocks, freezing, temporary organ decay prevention and surgery slows. Cryostylane when added to a corpse will tint them blue and pause organ decay temporarily, while it is in a mob it will slow down all surgery applied upon them. Inverse cryostylane will freeze you in a block of ice and put you in stasis (living and dead)."},{"2":"Tweaks cyrostylane to have a more indepth reaction, where colder temperatures will cause it's purity to decrease."},{"12":"cleans up some of holder.dm code and adds a REAGENT_IGNORE_STASIS bitflag."}],"Timberpoes":[{"0":"All uplink kits that previously had agent ID cards that were lost to the ID card rework now have agent ID cards again."},{"0":"Unhackable safes should no longer tell you the status of their service panel on examine."},{"0":"Modular Computer Tablets held in the ID slot will now correctly show SecHUD icons for their contained ID cards in all scenarios."},{"0":"Departmental Sec officers now appear as Sec members on the Crew Monitor."},{"11":"Ghost role protolathes and circuit imprinters now have a more restricted design inventory, with fewer advanced or experimental designs relating to bluespace, quantum tech and teleportation."}],"Whoneedspacee":[{"5":"Icebox mobs now have crusher trophies."},{"5":"Godslayer Armor can now be crafted by gathering drops from all three icebox megafauna."},{"5":"Adds the easy clockwork defender megafauna to the asteroid ruin."},{"11":"The Wendigo is now a proper megafauna."}],"Zytolg":[{"0":"Airlock Cyclelink Helpers can now function on the holodeck again."},{"12":"Airlocks can see out to 11 tiles now"}],"cacogen":[{"9":"Changes instances of DonkCo to Donk Co. to be consistent"}],"carshalash":[{"0":"Fixes this food being a steamed muffin monstrosity"}],"mozi_h":[{"2":"Consistency: Right-click to remove paper from a folder (instead of Alt-click)"},{"13":"Tidied up folder UI code"},{"5":"Clipboards have a snazzy new look."},{"13":"Gave clipboards some purpose in life: Edit, rename and sort to your hearts' desire! Insert a pen by just clicking it in. Rapidly pick up paper by clicking on it with the clipboard."}],"necromanceranne":[{"0":"Stops revenants gaining obscenely large essence (AKA health + power) pools by draining dying monkeys."}],"prodirus":[{"0":"Slimepeople should no longer be able to get to negative blood levels from toxin damage."},{"0":"Defibrillating slimepeople should no longer multiply toxin damage and reduce blood levels."},{"0":"People who are both toxin lovers and toxin immune should stop losing blood from toxin heals too."}],"stylemistake":[{"0":"Icons in tgui shouldn't disappear any more."}],"tralezab":[{"6":"No longereth can you faint when fainting would make you never wake up"}],"willox":[{"0":"merging stacks of materials no longer increases beauty more than it should"}]},"04 March 2021":{"Ghilker":[{"0":"mines no longer get triggered by directional lights"},{"0":"removed fire alarm from inside tcomms room due to triggering on roundstart"},{"0":"fixed infinite cable restrain exploit"},{"0":"lavaland clownplanet ruin outside turfs now spawn with normal air, no longer will kill the clowns near roundstart"}],"Kylerace":[{"13":"electrified chair behavior is now a component instead of a type"},{"7":"added a dir to the electrified chair overlay feature: make any chair into an electrified chair by attaching a shock kit to them over a live cable"}],"Maurukas":[{"0":"Fixes several lavaland ruins failing to generate the correct turfs"},{"0":"Fixes xeno hive ruin using space as it's baseturf"}],"Qustinnus":[{"0":"You can no longer sentience tourist bots"},{"0":"Sentient robots are no longer invincible"}],"Timberpoes":[{"0":"The Plexagon Access Management app has been upgraded and allows Heads of Staff to demote any ID card that has a trim they'd ordinarily be able to apply as a template. This means the HoS can now demote departmental sec officers like Security Officer (Science)."}],"YakumoChen":[{"5":"A less-than-new Syndicate Special bundle reminds you of the good old days when we didn't need all those newfangled traitor items the young-uns get. We had 6 items in the uplink and we had Monkey in rotation and by god we made do."}],"tralezab":[{"5":"The Chef now has a produce console for ordering ingredients! Botanists are still the best way to get stuff, though."},{"9":"fixed typo on the engineering voidsuit"},{"5":"Minebots treads now make noise as they move!"}]},"03 March 2021":{"Arkatos":[{"0":"Ghost language button will now properly show next to a mafia button, instead of being half a mile away in widescreen mode."},{"0":"Fixed Alien HUD having a language button inside a combat toggle button."},{"0":"Fixed AI HUD having a language button hidden behind a multicamera button in widescreen mode."},{"2":"Adjusted pAI HUD radio and language buttons to better fit their surroundings."},{"2":"Shifted borg language button a few pixels to better fit it's surroundings."}],"Dex":[{"0":"Survival capsules no longer get deleted when deployed at the edge of the map."}],"Fox McCloud":[{"0":"Fixes slimes and oozes not making noise when they move"}],"Ghilker":[{"0":"portable atmos reactions now work again"}],"Hadza":[{"0":"Fixes TRAIT_NOBREATH crit damage being applied after death"}],"KathrinBailey":[{"0":"Metastation's AI satellite is now wired to the station again."}],"KathyRyals":[{"6":"Operating computers no longer link to stasis beds."}],"Maurukas":[{"0":"The ruin of Ratvar will now properly spawn in Lavaland"}],"Melbert":[{"13":"Moved heirloom lists to species and job datums."},{"2":"Announced Extended shifts now send a command report listing station traits."},{"9":"Fixed some punctuation in station trait reports."},{"12":"Reduced some copy+paste in gamemode intercepts"}],"Qustinnus":[{"3":"French tourists now have their own audio cue"}],"TemporalOroboros":[{"0":"A recent firmware update reenabled the screens on Nanotransen brand computers."},{"0":"Bloodsplatter no longer experiences phantom limb syndrome on people missing both of their arms."},{"0":"Recent budget cuts have resulted in accessories no longer having magnets strong enough to pull bloodstains directly out of clothing. Washing machine usage has jumped 50% over the last week."},{"0":"No one is entirely certain who injected the the design schema for neon error signs into the mind magnification helmet production line, but the affected units have been recalled and the perpetrator <i>will</i> be brought to justice."}],"Timberpoes":[{"2":"Plexus Access Management app has had the Basic tab renamed to Trim to indicate that these accesses are available because of the card's trim. It also has an access counter so players can see they're able to change it."},{"2":"Plexus Access Management app has had the logic for displaying the used/available accesses for any given wildcard inverted. It now shows Used/Max instead of Available/Max."},{"0":"Wallets no longer show redundant examine text."}],"Time-Green":[{"5":"Plumbing reaction chambers now have connects for acidic (yellow) and basic (green) buffers! You can set the UI to indicate at what pH the reaction chamber is supposed to insert a buffer into the reaction."},{"5":"Adds plumbing bufferers. Place a bunch of them next to each other, set a threshold amount with right click and screwdriver them. Once all are above the threshold, only then will they start providing chems. Great for waiting steps and carefully dosing amounts!"},{"11":"The reaction chamber no longer pulls specific chems, and instead has a set volume it works towards before being able to react."}],"carshalash":[{"11":"Oxidates blue cherries and makes parsnips cause Alzheimer's"}],"mozi_h":[{"5":"Folders have a snazzy new look. (Check out those colours!)"},{"2":"Rapidly pick up paper by clicking on it with a folder. Alt-click to remove an item from a folder."},{"13":"Split and cleaned up folder code."}],"necromanceranne":[{"0":"Restores the missing cyborg suit directional sprites."}],"tralezab":[{"13":"tgui wizard panel"},{"5":"Japanese Tourists have been added!"},{"5":"And they brought Beef Stroganoff!"}],"vincentiusvin":[{"2":"Supermatter Monitor now shows total moles. It glows red if your SM is going to singulo."},{"12":"Supermatter's defines have been moved into it's own file in the __DEFINES folder."}]},"02 March 2021":{"Dex":[{"0":"Luxury bar capsule no longer runtimes when deployed."},{"0":"Water bottles no longer splash you when you press left mouse button in combat mode."}],"Fikou":[{"0":"powersinks now should be centered on the tile when dropped/thrown"},{"12":"ontop flag now checks for mobs too"},{"15":"adds some flags to the admin bitflag menus"}],"Ghilker":[{"0":"xenos and random event mobs can't spawn in atmos tanks"}],"Mothblocks":[{"15":"Admins can now cancel or replace midround rulesets."},{"0":"Admins can now correctly force midround rulesets."}],"Paxilmaniac":[{"0":"several duplicate items around metastation have been removed"}],"Qustinnus":[{"3":"Ethereals can now scream"}],"Ryll/Shaps":[{"5":"You can now smack your hand on tables to emphasize a point! Simply ready a slapper with *slap, then click on an empty table! Doing so with a left-click lets you fire off a series of weaker slaps, while a right-click makes one big, loud slam for maximum impact!"},{"0":"Right clicking someone in combat mode as a hulk will now shove them, like it does for normal humans"}],"SparkezelPL":[{"7":"Adds new radiation collector array sprites. If an array is turned on but has no tanks, it now displays an error animation."},{"9":"Removes \"Hawking Radiation\" in arrays with just radiation. It was nice to know you singulo..."}],"Thalpy":[{"0":"Fixes the randomly failing unit test that sometimes happens."}],"Timberpoes":[{"11":"ID cards have now completely changed. ID cards have limited available access slots increased by card rarity and the specific job trim. Jobs with more innate access now have more valuable ID cards. Better watch your backs!"},{"11":"Yes, this means that you can no longer mass-distribute unrestricted All Access. During War Ops, you're expected to protect the diskie and disk holder. Sec can distribute guns. Cargo can order guns. You can still get key accesses like Maint on any ID card. HoP can still create and trim special silver ID cards for high value staff members to get more access. Adapt. Overcome. Suffer."},{"11":"Chameleon ID cards are completely reworked. Instead of copying all accesses from a card, they now open up an interface where you can select up to 5 accesses to copy over depending on the target card's access. tweak: The ID Console has been updated to reflect these new changes including a somewhat improved layout. You can apply job templates direct to cards via a drop-down interface and these templates will attempt to fill out as many accesses on the card as it can based on the card's trim and the template's wildcard setup. tweak: The PDA Painter has now been upgraded with a tgui interface. It can be used to paint PDAs the same as before, but can now also change the trim on ID cards. This procedure will remove all access levels from the ID card in the process, leaving you with a freshly trimmed blank ID card. tweak: Captain job trims now have a white star instead of a dull grey star. removed: Mining Conscript Card has been removed and replaced with a spare mining ID that holds and has the access the Conscript card gave. tweak: The Captain's Spare ID has been moved from the Captain's locker to a secure safe on the bridge. The highest ranking Command member on shift start is given the codes to this safe, generally following the chain of command. The QM is part of this and can, in exceptional circumstances where no other heads join the shift, become Acting Captain. Their ID card would be given Bridge access if they were picked as Acting Captain to allow them to access the captain's spare. If nobody in the chain of command joins the shift, the next latejoined player from the chain of command will be given the codes for the spare and promoted to Acting Captain automatically. tweak: The secure safe on the bridge is a special variant that is immune to conventional weaponry and lacks the hacking mechanic of ordinary wall safes. Maybe if you could examine it close enough, you'd find hints to its weaknesses... tweak: Examining players now shows a more detailed representation of any ID card in their ID slot."},{"5":"Added the world's worst coder sprites for ID card overlays including PDA, Laptop and Wallet icons for when they're in the ID Card slot too. May God have mercy on your souls, for my spriting skills have none."}],"necromanceranne":[{"5":"Adds basic cybernetic eyes to the medical protolathe and mechfab. Adds improved cybereyes (equal to human eyes) to the Cybernetic Organs tech node."},{"0":"Fixes up a missing sprite when wearing the durathread bandana on your head."}]},"01 March 2021":{"ArcaneDefence":[{"0":"Janitor cyborgs are no longer capable of placing their bucket module on their own head, and feeble attempts to replace a no drop hat atop a cyborg's head will be met with failure."}],"Arkatos":[{"0":"Emagging escape pod console will now properly allow you to launch the pod even without required alert level. Farewell, security!"}],"Ghilker":[{"0":"fixed crystallizer, now working properly, the GUI was broken when i changed name of a var, now the gui works again, also the internal gasmixture wasn't initialized anymore for some reason"},{"11":"changed some recipe to cost less, zaukerite and SM shard cost a bit less now (was intended to be changed in the main PR but i forgot)"}],"Qustinnus, Kryson & uglykoala":[{"5":"Ethereals now crystalize on death, allowing them to heal themselves unless the crystal is destroyed, but giving them a brain trauma when its succesful. tweak: ethereals now stay emagged for longer"}],"cacogen":[{"12":"Should be less likely to get inedible food now"},{"0":"Slicing penguin meat slabs into raw cutlets should work again"}]},"28 February 2021":{"ArcaneDefence":[{"0":"Plungers on layer mode won't turn into the pink/black error sprite when worn on the face"}],"ArcaneMusic":[{"0":"Pin the tail on the corgi works again."}],"Burgerman":[{"0":"warden's police hat now no longer leaves a space before your message and people should now get Canadian conversions when they did not previously, cigarette will now convert to dart and scuffle will now convert to kerfuffle"}],"Ghilker":[{"5":"Crystallizer, a machine that converts gas mixtures into solid matter, usually crystals. Select a recipe and see the requirements to make that object. The green port is the input, the red port is the cooling/heating."},{"6":"removed zauker gas grenade"},{"5":"added n2o crystals (releases small amounts of n2o gas)"},{"5":"added crystal cells (high power cell but not rechargeable)"},{"5":"added zaukerite and relative recipes (aestetic item/bragging rights)"},{"5":"added gas recipe datums for multiple machines support"}],"Gurkenglas":[{"0":"The chaplain's null rod can now dispel the heretic's transmutation rune. Note that as with with the Nar'Sie rune, you must stand on it."}],"Iamgoofball":[{"11":"Poor Aim no longer blinds you, and now properly reflects the aiming capabilities of the galaxy's finest."}],"Thalpy":[{"2":"Improved the chemistry debug tools for people to use tweak: adjusted Helbital, Libital, probital, lenturi, aiuri, hercuri, convermol, tirimol, seiver, multiver, syriniver, synthflesh and penthrite to better use the new chemistry mechanics - see the wiki! tweak: Gave Helbital, Libital, probital, lenturi, aiuri, hercuri, convermol, tirimol, seiver, multiver, syriniver, synthflesh and penthrite impure mechanics"},{"3":"added a laugh for hel"},{"12":"Improved some of the reagents code to handle this"}],"YakumoChen":[{"2":"Hygienebots can fly over tables now."}],"cacogen":[{"0":"Watermelon slices spawned by an admin or by a map are edible"}],"tralezab":[{"0":"Restaurant Customerbots now gib into robotic gibs"}]},"27 February 2021":{"ATHATH":[{"0":"The daemon forge's normal description and stackcrafting description have been updated to reflect the recent changes to the daemon forge."}],"ArcaneDefence":[{"9":"Throat slitting combat logs are easier to understand"}],"Arkatos":[{"0":"Fixed a case where you were not able to move action buttons around."},{"0":"Fixed a missing title header of the Microscope UI."},{"0":"Fixed a missing title header of the R&D Console UI."}],"Dex":[{"0":"Fixed light floors not working properly."}],"Ghommie":[{"0":"combo streaks now reset after a while (default to 6 seconds), and not just visually, if no unarmed action is performed during that time period. Also, the combo hud now fades out, starting 2 seconds before the timed combo streak reset. Of course, the animation is halted and the opaqueness restored when the aforementioned \"countdown\" is interrupted."}],"Guillaume Prata and M. Joyce":[{"0":"Fixes Plasmamen ERT not spawning properly"},{"7":"Updated sprites for the CE and CMO Envirosuits and some small fixes on others."}],"Melbert":[{"0":"Fixes certain announcements (captain's announcements, nuclear operative war declaration, command reports, etc) not playing their respective sounds."},{"0":"Interns no longer override their superior's announced command reports."}],"Mothblocks":[{"5":"Dynamic will now play a part in controlling random event antagonists. If a dynamic midround injection is coming too soon, or too early, then the next midround injection will be buffed. Otherwise, it'll spawn normally."}],"Qustinnus":[{"5":"Added new station traits that gives departments / everyone death rattle implants"}],"Ryll/Shaps":[{"0":"Admins can actually use the Briefing Officer Outfit preference to set their preferred briefing outfit for ERT's now"},{"0":"Iron rods and pens can once again embed in targets if thrown at high speeds (like explosions)"},{"2":"Trying to use an emote while it's cooling down will now tell you how much longer you have to wait. This will only show for emotes with longer than normal wait times."},{"0":"Disabler beams from drop pods/frag grenades will no longer cause burn wounds."}],"TemporalOroboros":[{"5":"Nanotransen would like to make an official notice to all stations equipped with an SME (SuperMatter Engine) Since the last batch of crystals were shipped we have noticed an increased workplace accident occurrence rate in the engineering department. The supermatter is not made of candy. Do not lick it."}],"Time-Green":[{"0":"fixes hardcore random paying out double on deconversion"}],"Tlaltecuhtli":[{"2":"brand_intelligence event no longer has 30% prob of making an hull breaking explosion and destoying the machine when converting them to rogue vending machines which means there  is 30% more vending machines that get turned into rogue ones aka all the ones that got hit with the vending machine virus"}],"cacogen":[{"0":"Spawned hot cross buns (e.g. one in cafe on MetaStation) are edible again"},{"11":"Hot cross buns now use a bread slice instead of a loaf of bread (more economical)"}],"mozi_h":[{"0":"Sheets of carbon will no longer be infinite or invisible when copying."}],"prodirus":[{"0":"Allergy suffers should now stop accumulating histamine and toxin damage while in stasis."}],"redmoogle":[{"0":"Virology Healing Stat Bonuses Work Again"},{"0":"Virology Narcolepsy Increased Speed Works Now"}],"vincentiusvin":[{"2":"You can now check the EER of the supermatter as a ghost by examining it."}]},"26 February 2021":{"ArcaneMusic":[{"5":"There are now two experiments that botany can perform that boosts botany tech and experimental surgery."}],"Dex":[{"0":"Jukeboxes and disco balls are no longer invisible."}],"Fox McCloud":[{"0":"Fixes some future potential sound oddities"}],"Ghommie":[{"0":"fixed a problem with room beauty not updating when movables are moved around whilst contained within another movable, or when deleted."}],"Qustinnus, MrDoomBringer":[{"5":"The chef and the bartender can now open up their venues to tourist robots, different robots have different tastes and will come visit to buy your wares!"}],"Ryll/Shaps":[{"2":"Ghosts can start their messages in deadchat with asterisks again"}],"Son-of-Space":[{"5":"Completely redid MetaStation's exterior layout"},{"11":"Some of the solars on MetaStation weren't set up last shift. You'll have to build them yourselves."}],"SuperNovaa41":[{"0":"fixed forcing people into clown cars."}],"TJatPBnJ":[{"2":"Abductor tongues now tell you how to attune them on examine, and in the abductor shop."}],"Thalpy":[{"0":"Fixes smashed bottles not applying their splashing effect on people"},{"2":"Reduced the lag on the chemistry recipe lookup button on the dispenser"},{"0":"fixes ice cream temperatures in the ice cream vat"}],"Zytolg":[{"0":"Gets rid of a doublepipe that was throwing a bunch of mapping errors in the bar pipenet."}]},"25 February 2021":{"Arkatos":[{"2":"Updated radial menu for a spider selection from an egg cluster. It will now include a small button for showing additional information about given spider type."},{"2":"You can now choose a spider from an egg cluster from a distance instead of having to be next to them as a ghost."},{"0":"\"Click to play\" button on when spider egg cluster matures will now actually give you a selection of spiders to choose from instead of doing nothing."},{"2":"Radial close button is now more obvious and clear."}],"Burgerman":[{"11":"Powersink now needs 25 pop to buy and costs 1 more tc."}],"Fikou":[{"0":"fixes cult wraiths creating juggernauts instead"},{"0":"fixes right clicking with crowbar not working"}],"Gurkenglas":[{"5":"Spiders on web now ignore an absence of gravity."},{"2":"ninjaDrainAct is now used with rightclick, not toggled with HUD."}],"Mothblocks":[{"0":"Midround dynamic injection no longer has a 100% chance of activating."}],"Qustinnus":[{"13":"Glowshrooms now spread and decay different from before, hopefully preventing the issues they were causing with performance"},{"0":"Monkeys no longer rip apart machines from the inside"}],"Time-Green":[{"0":"Only maintenance maintpills now give you maintpill score"}]},"24 February 2021":{"Dex":[{"0":"Push broom will no longer slip you up while sweeping slippery items."},{"12":"Push broom now sweeps on pre move rather than moved."}],"Fikou":[{"0":"fixes pirate captain spawning with the wrong outfit"}],"Fikou, Floyd, coiax":[{"5":"Adds the Intento! Buy it in your local library vendor!"}],"Ghilker":[{"12":"readability, docs"}],"Kylerace":[{"0":"you can no longer use holodeck items to get stuck in custom vendors and do nothing else"},{"0":"custom vendors will no longer tell you an item cant be accepted twice in a row"}],"Qustinnus":[{"13":"Adds a subsystem for ai movement"}],"SomeAngryMiner (sprite), Qustinnus (porting)":[{"7":"Ports the supermatter sprite from Beestation"}],"Thebleh":[{"0":"Assembly parts no longer fall out of their holder when being picked up."}],"bobbahbrown, Qustinnus, MrDoomBringer, ArcaneMusic":[{"5":"Experi-sci. Some nodes in the techwebs will now require specific experiments to be done. Some will also give a discount to specific nodes"},{"6":"Active point generation has been removed from techwebs"}],"necromanceranne":[{"0":"Sticky tape no longer can be used on objects that aren't within reach."}]},"23 February 2021":{"Dex":[{"5":"Added a food cart to Kilo kitchen"}],"EOBGames":[{"5":"The Nanotrasen Entertainment Division has released a new card game designed to be played quickly and easily: Wiz-Off.! Join the battle at your local Fun Vendor today!"}],"Flareguy":[{"7":"Telescopic batons are now a discernible shape"}],"Ryll-Ryll":[{"13":"Implements JPS Pathfinding!! I'll do the rest of this later"}],"Thalpy":[{"0":"fixes cold reactions not reacting in a few limited cases"}],"necromanceranne":[{"11":"Shielded Robes and Mirror Shields can no longer be made from daemon forges."},{"11":"Eldritch Longswords and True Nar'sian Hardened Armor can be made from daemon forges. True Nar'sian Hardened Armor has no slowdown, unlike the lavaland version."},{"11":"The equipment spell now grants you a cult dagger. Still separate from the other spell so that you can acquire a dagger without being slapped with a validsuit."},{"11":"Eldritch longswords and cult daggers have block chance (50% and 25% respectively). Cult daggers cannot block projectiles and the cult ghost longsword only has 25% block chance."},{"11":"The cult blindfold only stuns you if you actually are stupid enough to put it over your eyes."},{"0":"Fixes the halberd not correctly displaying the correct inhand sprites."}],"vincentiusvin":[{"0":"atmos devices with multiple ends that is hooked to the same line can now redistribute pressure more consistently. (can connect to a single pipeline in more than one nodes)"}]},"22 February 2021":{"Dax Dupont":[{"9":"Fixed a type in gauze falling off message."}],"Fikou":[{"7":"adds new sprites for wizard cult constructs"},{"0":"fixes wraith jaunts being invisible"},{"0":"fixes wizard cult constructs not working"}],"Kathy Ryals":[{"11":"Atmos holofan projectors can now project up to six holograms. tweak: Swapped the engineering holofan projector in the CE locker for an atmos projector."}],"Melbert":[{"9":"The flavor text of the lifebringers has been adjusted for clarification."}],"Mothblocks":[{"0":"Fixed multiple high impact rulesets being chosen on Dynamic."}],"NamelessFairy":[{"0":"A levitating light switch in Metastation toxins storage has now been attached to a wall"}],"TemporalOroboros":[{"0":"Mounted seclights work again."}],"Tlaltecuhtli":[{"0":"fire extinguisher particles can go through machinery, lockers, crates and extinguish the air on top of them"},{"12":"fire extinguisher uses modern pass_flags code instead of shit code"},{"12":"new passflag : PASSDOOR instead of being ''''PASSMACHINERY'''' added  it to xray , some sniper thing and crucible pot to have same effects as before"}],"dragomagol":[{"0":"Icebox public mining APC now uses the correct area"}],"itseasytosee":[{"0":"Rust Heritec slime people will no longer be hurt by rust"}],"necromanceranne":[{"0":"Stops the rune carver from carving on invalid targets."}],"theOOZ":[{"2":"Better visual clarity of the health scanner's text colors."}]},"21 February 2021":{"ArcaneDefence":[{"0":"Limbs melted by plasma lava on icebox will not become invisible any more."}],"Arkatos":[{"0":"Fixed a case where certain Auxiliary Base construction options were not working properly. Better get building!"}],"Dex":[{"0":"Raven evac shuttle can now early launch"}],"General Bazelart Haffaz Aladeen":[{"15":"Sorry I changed secrets panel again, it's more organized and has open spaces for some new buttons"},{"15":"Making everyone monkey from secrets panel no longer snitches to the entire server"},{"15":"Readded change all species button to only fun for you"}],"Ghilker":[{"12":"readability, docs"}],"Imaginos16":[{"5":"NanoTrasen has now graciously created new outfits for their esteemed members of Central Command! These include new turtlenecks, a fancy coat, a new cap, and a skirt edition of the current Official jumpsuit."},{"8":"As a result of these changes of apparel, however, NanoTrasen came to the decision to remove the old CentCom Officer Jumpsuits in favor of the Turtlenecks."}],"RaveRadbury":[{"0":"Binary Encryption keys work in pAIs that have downloaded the encryption key software."}],"TemporalOroboros":[{"12":"Adds update_appearance, update_name, and update_icon"},{"5":"The supermatter can now consume miasma in the air to power itself."},{"13":"Mobcode is now ever so slightly more consistent"}],"Thalpy":[{"5":"Adds a new reaction lookup window to the chem dispenser"},{"5":"Adds the chemistry tab in the crafting menu for ghetto chemists, this allows users to create tabletop burners, thermometers, pH booklets, droppers, improvised chem heaters and improvised cooling sprays"},{"5":"Adds 2 new reactions - ice and universal indicator"},{"13":"Refactors part of crafting code to allow use of machinery and optimises part of the code"},{"0":"fixed addictions not applying moods and start procs correctly"}],"Timberpoes":[{"0":"The buckled, handcuffed and legcuffed alerts now work properly when clicked on."}],"Time-Green":[{"0":"Fixes roundstart runtime from addictions"},{"0":"fix chemscan runtiming on mindless"},{"0":"Fixes reagent chambers not working"}],"c420-o":[{"5":"Added foam finger, toy and admeme version"},{"15":"added foam finger"}],"cacogen":[{"2":"Crafting menu will now tell you which colour of crayon is needed (useful for recipes like the crazy burger)"}],"itseasytosee":[{"2":"death examination are less confusing"}],"necromanceranne":[{"0":"Fixes regal pipeguns inheriting jamming from pipeguns."},{"0":"Fixes projectile_damage_multiplier not applying to stamina damage dealt by projectiles."},{"12":"Tidies up some of the code in living duffel bags to meet contribution guidelines."}],"timothymtorres":[{"0":"Fixed cigarettes being lit in no-oxygen environments"},{"5":"Cigarettes can be injected with oxygen to allow smoking anywhere"},{"12":"The cigarette brand 'Space cigarettes' now has oxygen in it's default reagents (allowing it to be smoked in space)"}],"tralezab":[{"5":"New Event: Shuttle Insurance!"}]},"19 February 2021":{"Kylerace":[{"0":"personal training units can now have toolboxes attached to them again"},{"12":"there are no longer BB's inside your guns. whatever that means"}],"NotRanged":[{"0":"Fixes hitscan beams not reflecting off of certain tiles (e.g. reflective blob) properly."}],"Qustinnus":[{"0":"fixes has_material_type and has_material_category always returning a true value"}],"Thalpy":[{"12":"improves holder.dm readability"},{"0":"fixes explosive chems without temperature requirements to explode at any temperature"}],"Timberpoes":[{"0":"When a player is held up at gunpoint, the HUD alert is no longer permanent and will be removed when the player is no longer held up."},{"0":"Observers can no longer click on alert icons to perform actions when auto-observing players."}],"dragomagol":[{"15":"build mode fill tool now asks for confirmation when filling an area greater than 150 tiles"}],"necromanceranne":[{"12":"Cleans up the weirdness of Blood Halberds by bringing them under the cultblade parent, as well as making their code more compliant with contributor guidelines. Also renames them to Bloody Halberds."},{"2":"Blood Rites now uses a radial menu to choose which spell to cast."},{"7":"A new sprite for the Bloody Halberds. It looks more like a polearm."},{"0":"Adds a sprite for plushies in suit storage slots."}],"timothyteakettle":[{"0":"stops people using message all when their pda doesn't allow it"}]},"18 February 2021":{"Fikou":[{"2":"you can now open airlocks and firedoors and stuff with a crowbar on combat mode by right clicking"},{"5":"you can now cast rituals on dynamic if the threat level is 100"}],"Kryson, Qustinnus":[{"5":"All drug addictions are now put into 5 categories: Stimulants, Opiods, Alcohol, hallucinogens, and maintenance drugs. There is no longer an addiction threshold and becoming addicted is done by gaining addiction points from doing drugs in a specific category, if you become addicted you can stop being addicted by lowering your addiction points until it reaches a low enough value."}],"LemonInTheDark":[{"0":"Fixes a very rare edgecase that could cause spawned ghosts to be unable to move"}],"Melbert":[{"5":"Tailed species now get very upset if you steal their tail from them."}],"Mothblocks, Qustinnus":[{"5":"Hovering your mouse over things now shows their name on the top of the screen"}],"NotRanged":[{"5":"The Reactive Spines blob strain's retaliation now applies the strain's reagents, and can trigger once every 2.5 seconds."},{"0":"Fixed and changed the Explosive Lattice blob strain. It didn't work at all, but now actually applies an AoE of light burn/brute."},{"12":"Changed comments and descriptions of various blob strains to be more consistent."}],"Thalpy":[{"0":"Fixes reaction chambers eatting beakers, and lets users eject beakers when out of power with alt."}],"Timberpoes":[{"0":"Viewing your playtime panel as a non-admin should no longer yell at you in chat that you have insufficient rights."}],"Time-Green":[{"5":"Adds the auto IV! You ever wanted to feed the clown actual oceans of morphine? You can! You can technically hook up 9 of these to 1 person, so go into your plumbing RCD and have fun! You can also draw blood with it I guess"},{"2":"Changing the drip speed on an IV is now on right click instead of alt"}],"Whoneedspacee":[{"5":"You can now purchase ice hiking boots from the mining vendor."},{"5":"You can now craft plasma lava boats from polar bear hide."},{"5":"Icebox turfs can now be mined with your bare hands. tweak: Icebox creatures now have signals that can be tracked."},{"11":"Ash drake armor now has cold protection so it can be used on icebox."}],"cacogen":[{"0":"You can no longer receive 50x the value of items sold with barcodes on the Supply shuttle tweak: Sales barcode profit splits will consistently default to 50% (you can still set this to less, but there's no reason to at the moment) tweak: Sales tagger examine message improvements tweak: Sales tagger and GrandArk Exporter tablet app both tell you the valid range to set the profit split in now"},{"9":"'Barcode tag' is now called 'barcode tag'"}],"drongood12":[{"0":"the BRPED beam now hits exactly the object"}],"necromanceranne":[{"0":"Corrects an incorrectly set var in syndicate portable turrets that prevented them from firing."}]}}