import { Antagonist, Category } from '../base';

const SpaceNinja: Antagonist = {
  key: 'spaceninja',
  name: 'Космический ниндзя',
  description: [
    `
      Клан Пауков практикует своего рода увеличение человеческой плоти, чтобы
      достичь более совершенного состояния бытия и следовать постмодернистскому космическому бусидо.
    `,

    `
      Станьте коварным космическим ниндзя, вооруженным катаной, перчатками для
      взлома шлюзов и бронетранспортеров, костюмом, который сделает вас почти невидимым,
      а также различными способностями в вашем арсенале. Взломайте консоли арестованных,
      чтобы пометить всех как арестованных, и даже взломайте консоли связи,
      чтобы вызвать больше угроз и посеять хаос на станции!
    `,
  ],
  category: Category.Midround,
};

export default SpaceNinja;
